Repository: montecab/FriProj
Catalog: po-boy/blockly/2.8.2/blockly_challenges_*.po
Languages: de_de

source: Driving School
de_de: Fahrschule

source: Dash needs your help! Teach Dash to drive safely around the Wonder Workshop neighborhood square, which is full of surprises!
de_de: Dash braucht deine Hilfe! Bring Dash bei, sicher durch die Straßen der Wonder Workshop-Stadt zu fahren. Hier warten tolle Überraschungen auf dich!

source: License to Drive
de_de: Führerschein geschafft!

source: Fantastic! Dash is happy to know how to drive safely around the neighborhood.
de_de: Fantastisch! Dash weiß nun, wie man sicher durch die Gegend fährt.

source: Press the <span class='text-bounce'><b>START</b></span> button to get Dash's engine going!
de_de: Drücke auf <span class='text-bounce'><b>START</b></span>, um den Motor von Dash zu starten!

source: Connect the blocks to teach Dash how to <b>drive forward</b>! Press <b>Start</b> to run your program.
de_de: Verbinde die Blöcke miteinander, um Dash beizubringen, wie er <b>vorwärtsfahren</b> kann! Drücke auf <b>Start</b>, um dein Programm zu starten.

source: Drag and stack one block from the <b>Drive</b> menu to teach Dash how to <b>drive <u>backward</u>.</b>
de_de: Füge einen Block aus dem Menü <b>Fahren</b> zum Stapel hinzu, um Dash beizubringen, wie er <b><u>rückwärtsfahren</u> kann.</b>

source: Unscramble the blocks to teach Dash how to <b>forward, backward,</b> and <b>forward</b> again!
de_de: Bring die Blöcke in die richtige Reihenfolge, um Dash beizubringen, <b>vorwärts-, rückwärts-</b> und wieder <b>vorwärtszufahren</b>!

source: Delete the <b>Turn Left</b> block so Dash can <b>turn right</b> twice!
de_de: Lösche den Block <b>Nach links fahren</b>, damit Dash zweimal <b>nach rechts fahren</b> kann!

source: Delete the <b>Turn Left</b> block so Dash can <b>turn right</b> <u>four</u> times.
de_de: Lösche den Block <b>Nach links fahren</b>, damit Dash <u>viermal </u><b>nach rechts fahren</b> kann.

source: Teach Dash to <b>look left, look right,</b> then <b>look forward</b>!
de_de: Bring Dash bei, <b>nach links zu schauen, nach rechts zu schauen</b> und dann <b>nach vorne zu schauen</b>!

source: Stack the blocks to make Dash <b>drive forward</b>, then <b>look left</b>, and then <b>turn left</b>. Then make Dash <b>look forward</b>.
de_de: Stapele die Blöcke, um Dash erst <b>vorwärtsfahren</b>, dann <b>nach links schauen</b> und daraufhin <b>nach links fahren</b> zu lassen. Lass Dash dann <b>nach vorne schauen</b>.

source: Stack the blocks to make Dash turn <b>all lights red</b> then turn <b>all lights green.</b>
de_de: Stapele die Blöcke, um bei Dash erst <b>alle Lichter rot</b> und dann <b>alle Lichter grün</b> aufleuchten zu lassen.

source: Teach Dash to drive <b>forward</b>, turn <b>all lights red</b>, turn <b>all lights green</b>, <b>look left</b>, and then <b>turn left</b>. Then make Dash <b>look forward.</b>
de_de: Bringe Dash bei, <b>vorwärtszufahren</b>, <b>alle Lichter rot</b> aufleuchten zu lassen, <b>alle Lichter grün</b> aufleuchten zu lassen, <b>nach links zu schauen</b> und dann <b>nach links zu fahren</b>. Lass Dash dann <b>nach vorne schauen.</b>

source: Program Dash's head to nod by looking <b>down</b>, looking <b>up</b>, then looking <b>straight</b>. Make Dash <b>say "Hi!"</b>
de_de: Programmiere den Kopf von Dash so, dass er nickt, indem er zuerst <b>runter</b>, dann <b>hoch</b> und dann <b>geradeaus</b> schaut. Lass Dash <b>„Hallo!“ sagen.</b>

source: Teach Dash how to blink. Edit these eye pattern blocks so they turn the eye <b>all on</b>, then <b>all off</b>, and finally <b>all on</b>.
de_de: Bring Dash bei, wie man blinzelt! Bearbeite diese Blöcke für das Augenmuster, damit zuerst am Auge <b>alle Lichter eingeschaltet</b>, dann <b>alle Lichter ausgeschaltet</b> und zuletzt wieder <b>alle Lichter eingeschaltet</b> werden.

source: Dash on Planet X
de_de: Dash auf Planet X

source: Dash is stranded on Planet X and surrounded by giant aliens. You’ll have to rescue Dash!
de_de: Dash ist auf Planet X gelandet und von riesigen Aliens umzingelt. Du musst Dash retten!

source: Hooray for friendly aliens!
de_de: Ein Hoch auf friedliche Aliens!

source: Was it more fun to be the scary alien or the friendly one? What other things can you program Dash to wait for?
de_de: Spielst du lieber den furchteinflößenden oder den friedlichen Alien? Kannst du noch andere Dinge programmieren, auf die Dash warten soll?

source: When Dash detects an alien's giant tentacle coming for comfort, Dash says “Uh-oh!” Try the program by tapping <b>Start</b> and putting your hand in front of Dash!
de_de: Lass Dash „Oh, oh!“ sagen, sobald sich der Riesententakel eines Aliens nähert, um ihn friedlich zu begrüßen. Probiere das Programm aus, indem du erst auf <b>Start</b> tippst und dann deine Hand vor Dash hältst!

source: You don't need to do anything to this program. Just tap <b>Start</b> and then put your hand or foot in front of Dash to make Dash react!
de_de: Bei diesem Programm musst du nichts machen. Tippe einfach auf <b>Start</b>, halte deine Hand oder deinen Fuß vor Dash und beobachte seine Reaktion!

source: <b>Add to the program</b> to make Dash back away fast after saying, "Uh oh!" Then Dash should do a head shake and look forward.
de_de: <b>Bau das Programm nun ein bisschen aus und</b> lass Dash schnell zurückweichen, nachdem er „Oh, oh!“ gesagt hat. Danach sollte Dash den Kopf schütteln und nach vorne schauen.

source: A head shake includes looking <b>left</b>, looking <b>right</b>, then looking <b>forward</b>. Be sure to put your hand or foot in front of Dash to make Dash react!
de_de: Beim Kopfschütteln muss Dash zuerst nach <b>links</b>, dann nach <b>rechts</b> und dann <b>geradeaus</b> schauen. Achte darauf, dass du deine Hand oder deinen Fuß vor Dash halten musst, damit er reagiert!

source: The danger isn’t over! Make Dash <b>wait for</b> an alien tentacle sneaking up from <b>behind</b>. Make Dash say, "Uh-oh!" then move <b>forward</b> and <b>turn</b> around to face the alien!
de_de: Die Gefahr ist noch nicht gebannt! Lass Dash <b>warten</b>, bis sich der Tentakel eines Aliens von <b>hinten</b> anschleicht. Lass Dash erst „Oh, oh!“ sagen, dann <b>vorwärtsfahren</b> und sich daraufhin <b>umdrehen</b>, damit er dem Alien ins Auge sehen kann!

source: <li>A 180° turn will make Dash turn around to face the danger. <li>Be sure to put your tentacle (or foot) in front of Dash and then behind Dash to make Dash react!
de_de: <li>Bei einer 180°-Drehung dreht Dash sich um, damit er der Gefahr ins Auge blicken kann. <li>Achte darauf, dass du deinen Tentakel (oder Fuß) zuerst vor Dash und dann hinter Dash halten musst, um ihn reagieren zu lassen!

source: There’s a thunderstorm brewing on Planet X. <b>Add blocks</b> to make Dash <b>wait for</b> a <b>clap</b>, say "Huh?" and <b>turn</b> around in a <b>360° circle</b>.
de_de: Auf Planet X braut sich ein Gewitter zusammen. <b>Füge Blöcke hinzu</b>, um Dash auf ein <b>Klatschgeräusch </b><b>warten</b>, „Hä?“ sagen und sich dann <b>360° im Kreis </b><b>drehen</b> zu lassen.

source: A 360° turn left or right is a complete circle. Use a <b>Wait for</b> block to make Dash <b>wait for</b> a <b>clap</b> and then react! Be sure to edit the block.
de_de: Für eine 360°-Drehung nach links oder rechts muss Dash sich einmal um die eigene Achse drehen. Verwende einen Block der Kategorie <b>Warten</b>, um Dash so lange <b>warten</b> zu lassen, bis er ein <b>Klatschgeräusch</b> hört. Erst danach darf er reagieren! Vergiss nicht, den Block zu bearbeiten.

source: It’s time to rescue Dash. You are now a friendly giant alien. <b>Add to the program</b> so that Dash <b>waits for</b> rescue. When you <b>pick up</b> Dash, the robot should <b>sigh</b> in relief.
de_de: Es ist Zeit, Dash zu retten. Jetzt verwandelst du dich in einen friedlichen Riesenalien. <b>Programmiere Dash so</b>, dass er auf Rettung <b>wartet</b>. Wenn du Dash <b>aufhebst</b>, sollte der Roboter vor Erleichterung einen <b>Seufzer</b> ausstoßen.

source: Dash can <b>wait</b> to be picked up using a <b>Wait For</b> block. Be sure to edit the block.
de_de: Dash kann <b>warten</b>, bis er aufgehoben wird, wenn du einen Block der Kategorie <b>Warten</b> verwendest. Vergiss nicht, den Block zu bearbeiten.

source: Dash is very happy to see the friendly alien. <b>Add to the program</b> to make Dash <b>wait for</b> you to press the top button, smile at you, and say "Hi!"
de_de: Dash ist sehr erleichtert, auf einen friedlichen Alien zu treffen. <b>Programmiere Dash nun so,</b> dass er <b>wartet</b>, bis du auf den oberen Knopf drückst, um dich dann anzulächeln und „Hallo!“ zu sagen.

source: You can change the pattern of Dash's eye lights to create a smile.
de_de: Du kannst das Muster der Augenlichter von Dash so programmieren, dass er lächelt.

source: Dash the Snowman
de_de: Schneemann Dash

source: All it takes is a clap to make Dash the Friendly Snowman come to life with song and dance!
de_de: Ein Klatschgeräusch erweckt Dash, den freundlichen Schneemann, zum Leben und lässt ihn einen tollen Tanz aufführen und ein Lied spielen!

source: Let's get frosty!
de_de: Jetzt wird's frostig!

source: Now you've got a friendly snowman! Can you change the program so Dash comes to life when someone gets too close?
de_de: Und da ist er, der freundliche Schneemann! Kannst du das Programm so ändern, dass Dash zum Leben erweckt wird, sobald jemand ihm zu nahe kommt?

source: Connect the blocks so that the Eye Pattern <b>repeats forever</b> in a loop. You <b>don't</b> need to edit the eye patterns.
de_de: Verbinde die Blöcke so miteinander, dass das Augenmuster sich automatisch <b>endlos wiederholt</b>. Dafür musst du die Augenmuster <b>nicht</b> ändern.

source: <li>Put the <b>Eye Pattern</b> blocks into a <b>Repeat Forever</b> block to create a loop.<li>Stack the <b>Repeat Forever</b> loop under the <b>All Lights</b> block.
de_de: <li>Zieh die Blöcke für das <b>Augenmuster</b> in einen Block der Kategorie <b>Endlos Wiederholen</b>, damit die Aktion immer wieder ausgeführt wird. <li>Zieh den Block <b>Endlos Wiederholen</b> unter den Block <b>Alle Lichter</b>.

source: Stack the <b>Eye Pattern</b> blocks under the green <b>When</b> block. Edit the green <b>When</b> block so that Dash will do the eye patterns <b>when someone claps</b>.
de_de: Zieh die Blöcke für das <b>Augenmuster</b> unter den grünen Block <b>Wenn</b>. Bearbeite den grünen Block <b>Wenn</b>, damit Dash die Augenmuster anzeigt <b>, sobald jemand in die Hände klatscht.</b>

source: <li>You don't need to change any of the eye patterns. Just drag the stack under the <b>When Dash Top Button</b> block.<li>Then tap the <b>When Dash Top Button</b> block to edit it. Choose <b>When Dash Hear Clap</b>.
de_de: <li>Du kannst die Augenmuster alle so lassen, wie sie sind. Zieh deinen Stapel einfach nur unter den Block <b>Wenn Dash Oberer Knopf</b>. <li>Tippe dann auf den Block <b>Wenn Dash Oberer Knopf</b>, um ihn zu bearbeiten. Wähle daraufhin <b>Wenn Dash Klatschen hören</b> aus.

source: Add a new block to the bottom of the long stack of Eye Pattern blocks. The new block should make Dash do the <b>Greet Dash Hello</b> animation.
de_de: Zieh einen neuen Block an das untere Ende des langen Stapels mit den Blöcken für die Augenmuster. Der neue Block sollte Dash die Animation <b>Grüßen Dash Hallo</b> wiedergeben lassen.

source: <li>To find <b>Greet Dash Hello</b>, open the <b>Animations</b> section of the menu. Then choose <b>Greet Dash Hi</b>. Change it to <b>Greet Dash Hello</b>.<li>This block is an <b>Animation</b>, so Dash will talk and move at the same time.
de_de: <li>Um die Aktion <b>Grüßen Dash Hallo</b> zu finden, musst du einfach nur im Menü <b>Animationen</b> die Option <b>Grüßen Dash Hi</b> öffnen. Ändere die Animation in <b>Grüßen Dash Hallo</b>. <li>Dieser Block ist eine <b>Animation</b>, d. h. Dash kann gleichzeitig sprechen und sich bewegen.

source: Interrupting Robot
de_de: Klopf, klopf! Wer ist da?

source: Dash wants to tell you a robot version of the <b>Interrupting Cow</b> knock-knock joke.
de_de: Dash möchte dir die Roboterversion des Klopf-Klopf-Witzes mit der <b>ungeduldigen Kuh</b> erzählen.

source: That's one funny robot!
de_de: Was für ein lustiger Roboter!

source: Now your joke is set up. Give it a try with a friend or parent and see what happens!
de_de: Jetzt hast du deinen Witz programmiert. Teste gleich mal mit einem Freund oder einem Elternteil, was passiert!

source: Make Dash <b>wait for</b> you to speak and then <b>turn to</b> your <b>voice</b>. Then make Dash say "knock knock." Tap <b>Start</b> and ask Dash to tell you a joke.
de_de: Lass Dash <b>warten</b>, bis du etwas sagst, und sich dann in die Richtung <b>drehen, aus der </b>deine <b>Stimme </b> kommt. Lass Dash daraufhin „Klopf, klopf!“ sagen. Tippe dann auf <b>Start</b> und bitte Dash, dir einen Witz zu erzählen.

source: <li>Edit the <b>Wait for</b> block so that Dash waits for you to <b>speak</b> after you press "Start"! <li>Use the <b>My Sounds</b> block, and record your voice onto the first slot.
de_de: <li>Bearbeite den Block <b>Warten</b>, damit Dash so lange wartet, bis du <b>etwas sagst</b>, nachdem du „Start!“ gedrückt hast! <li>Verwende den Block <b>Meine Sounds</b>. Nimm dann deine Stimme auf und speichere die Aufnahme im ersten Sound-Slot.

source: <b>Add to the program</b>. Make Dash <b>wait</b> for a <b>voice</b>, <b>look toward</b> the <b>voice</b> asking "Who's there?", and then say, "interrupting little blue robot named Dash!"
de_de: <b>Füge nun eine weitere Aktion zum Programm hinzu</b>. Lass Dash auf den <b>Satz</b>„Wer ist da?“<b> warten</b> und <b>in die Richtung schauen, aus der die </b><b>Stimme</b> kommt. Lass ihn dann sagen: „Ein ungeduldiger kleiner Roboter namens Dash, der andere liebend gerne unterbricht!“

source: <li>Use a different <b>My sounds</b> slot. <li>When you record, "interrupting little blue robot named Dash," don't say it too fast, because Dash needs a few seconds to interrupt.
de_de: <li>Verwende einen anderen Slot unter <b>Meine Sounds</b>. <li>Wenn du „Ein ungeduldiger kleiner Roboter namens Dash, der andere liebend gerne unterbricht!“ aufnimmst, solltest du darauf achten, nicht zu schnell zu sprechen, da Dash ein paar Sekunden braucht, um dich zu unterbrechen.

source: Make Dash interrupt you! Program Dash to <b>wait for</b> a voice, <b>look toward</b> the <b>voice</b>, and say <b>Ay Yai Yai</b>. Dash should interrupt you during the joke!
de_de: Lass dich von Dash unterbrechen! Programmiere Dash so, dass er <b>wartet</b>, bis er eine Stimme hört, <b>in die Richtung schaut</b>, aus der die <b>Stimme</b> kommt, und dann <b>Ei, ei, ei</b> sagt. Dash sollte dich unterbrechen, während du den Witz erzählst.

source: <li>The <b>Ay Yai Yai</b> sound is in the <b>weird sounds</b> area.<li>Dash should interrupt you while you are saying, "little blue interrupting robot named Dash who?"
de_de: <li>Den Sound <b>Ei, ei, ei</b> findest du in der Kategorie <b>Komische Sounds</b>. <li>Dash sollte dich unterbrechen, während du sagst „Ein ungeduldiger kleiner Roboter namens Dash, wer?“.

source: Police Officer Dash
de_de: Kommissar Dash

source: Police Officer Dash is standing guard. When a criminal comes around, Dash springs into action and goes after the intruder.
de_de: Kommissar Dash hält Wache. Wenn ein Verbrecher um die Ecke kommt, ist Dash sofort zur Stelle und verfolgt ihn.

source: Officer Dash is on the beat!
de_de: Kommissar Dash ist auf Patrouille!

source: Now your robot police officer is ready! What other stuff can you add to make Dash an even better police officer?
de_de: Jetzt ist Kommissar Dash bereit, um auf Streife zu gehen! Kannst du auch andere Dinge programmieren, damit Dash ein noch besserer Polizist wird?

source: Police Offer Dash needs a bold expression. Complete the eye pattern.
de_de: Kommissar Dash muss streng gucken. Dafür brauchst du das passende Augenmuster.

source: Tap the <b>Eye Pattern</b> block to edit it. You can complete the eye pattern that's already there or make up one of your own!
de_de: Tippe auf den Block <b>Augenmuster</b>, um ihn zu bearbeiten. Du kannst das vorprogrammierte Augenmuster verwenden und ausbauen oder ein komplett eigenes erstellen!

source: Add a new <b>When</b> block to the canvas. After you press Dash's Top Button, make Dash say something a police officer might say, like "Stop, police!"
de_de: Zieh einen neuen Block der Kategorie <b>Wenn</b> in die Bildschirmmitte. Lass Dash, wenn sein oberer Knopf gedrückt wird, etwas sagen, was ein Polizist typischerweise sagen würde, z. B. „Halt, Polizei!“.

source: Try adding a <b>When</b> block to the canvas to start a new stack.
de_de: Versuche, einen Block der Kategorie <b>Wenn</b> in die Bildschirmmitte zu ziehen, um einen neuen Stapel zu starten.

source: After Dash warns the criminal, Dash’s siren should go off. Can you find a siren to <b>add to the program</b>?
de_de: Nachdem Dash den Verbrecher gewarnt hat, sollte seine Sirene losgehen. Findest du eine Sirene, die du <b>zum Programm hinzufügen</b> kannst?

source: Let Dash’s siren go off <b>after</b> warning the criminal.
de_de: Lass die Sirene von Dash losgehen, <b>nachdem</b> er den Verbrecher gewarnt hat.

source: Now for the flashing lights. Rearrange the blocks so the lights flash <b>red</b>, then <b>blue</b> immediately after the <b>siren</b>.
de_de: Nun brauchen wir noch ein Blaulicht. Ordne die Blöcke so an, dass die Lichter erst <b>rot</b> und dann <b>blau</b> aufleuchten, nachdem die <b>Sirene</b> losgegangen ist.

source: You don’t need to add any new blocks. Just put the blocks in the correct stack.
de_de: Du musst keine neuen Blöcke hinzufügen. Ziehe die Blöcke einfach in den richtigen Stapel.

source: Can you make the flashing lights and eye patterns <b>repeat 2 times</b> by adding a <b>Repeat</b> block? You will need to edit the <b>Repeat</b> block.
de_de: Kannst du das Blaulicht und die Augenmuster auch <b>2 Mal wiederholen</b> lassen, indem du einen Block der Kategorie <b>Wiederholen</b> hinzufügst? Du musst den Block <b>Wiederholen</b> dann bearbeiten.

source: The warning and siren only need to happen once, but the flashing lights should <b>repeat 2 times</b>.
de_de: Die Warnung und die Sirene müssen nur einmal abgespielt werden, aber das Blaulicht sollte sich <b>2 Mal wiederholen</b>.

source: After the <b>Repeat 2 Times</b> block, add a block to make Officer Dash rush toward the criminal.
de_de: Nach dem <b>Block Wiederholen 2 Mal,</b> brauchst du einen Block, damit Kommissar Dash den Verbrecher verfolgt.

source: Program Dash to move forward as fast as possible.
de_de: Programmiere Dash so, dass er so schnell wie möglich vorwärtsfährt.

source: Make Dash give a second warning. It can be something like, "You are under arrest!"
de_de: Lass Dash eine zweite Warnung abgeben. Das kann so etwas sein wie „Sie sind festgenommen!“.

source: Be sure to use a different <b>My sounds</b> slot from the one you used for the first warning.
de_de: Achte darauf, dass du hier einen anderen Slot unter <b>Meine Sounds</b> verwendest als für die erste Warnung.

source: Robot Puppy Training
de_de: Welpen-Robotraining

source: You are going to train your own robot puppy! Dash can become part robot, part puppy, and loads of fun.
de_de: Jetzt erziehst du dein eigenes Roboterhündchen! Dash kann zur einen Hälfte Roboter und zur anderen Hälfte Hündchen sein – das wird ein Riesenspaß!

source: Now you have a trained robot puppy!
de_de: Jetzt hast du ein braves Roboterhündchen!

source: Try teaching Dash some other tricks with the rest of the buttons or with a clap! Some of our favorite tricks are: turn around, play dead, and go crazzzzzy!
de_de: Versuch nun, Dash ein paar weitere Tricks mit den anderen Knöpfen oder mit einem Klatschgeräusch beizubringen! Einige unserer Lieblingstricks sind „Dreh dich um!“, „Stell dich tot!“ und „Spiel verrüüüüückt!“.

source: Dash wants to be petted! Tap <b>Start</b>, then push Dash's top button to see what happens. Notice that the programs are in 2 stacks.
de_de: Dash möchte gerne ein Hündchen sein. Tippe auf <b>Start</b> und drücke dann auf den oberen Knopf von Dash, um zu sehen, was passiert. Ist dir aufgefallen, dass das Programm aus 2 Stapeln besteht?

source: In this step you don't need to add any blocks. Just tap <b>Start</b> and try out the program by pushing Dash's <b>top button</b>.
de_de: In diesem Schritt musst du keine Blöcke hinzufügen. Tippe einfach nur auf <b>Start</b> und probiere das Programm aus, indem du auf den <b>oberen Knopf</b> von Dash drückst.

source: Dash is hungry! Add blocks under <b>When Dash Obstacle In Front</b> to make Dash <b>look up</b> and <b>down</b> and make a <b>sound</b>. Dash will detect your hand and think you have a treat!
de_de: Dash hat Hunger! Füge Blöcke unter <b>Wenn Dash Hindernis Vorne</b> hinzu, damit Dash <b>hoch</b> und <b>runter</b> schaut und einen <b>Sound</b> abspielt. Dash erkennt deine Hand und denkt, dass du ein Leckerli für ihn hast!

source: <li>Don't delete any blocks from the last step! <li>Record your own sound, such as your pet slurping up the food!
de_de: <li>Achte darauf, keine Blöcke aus dem letzten Schritt zu löschen! <li>Nimm deinen eigenen Sound auf. Du kannst zum Beispiel so tun, als wärst du ein Tier, das beim Fressen schmatzt.

source: Add blocks under the <b>When Dash Picked Up</b> block so that Dash looks <b>left</b>, looks <b>right</b>, and then makes a <b>dog sound</b>. Dash likes being picked up!
de_de: Füge Blöcke unter dem Block <b>Wenn Dash Aufgehoben</b> hinzu, damit Dash erst nach <b>links</b> und nach <b>rechts</b> schaut und dann einen <b>Hunde-Sound</b> abspielt. Dash liebt es, aufgehoben zu werden.

source: Add 3 new blocks under the <b>When Dash Picked Up</b> block. 2 of them should be <b>Look</b> blocks.
de_de: Füge 3 neue Blöcke unter dem Block <b>Wenn Dash Aufgehoben</b> hinzu. Davon sollten 2 Blöcke aus der Kategorie <b>Schauen</b> sein.

source: Drag a new <b>When</b> block onto the canvas. Edit the <b>When</b> block. When Dash <b>hears</b> your <b>voice</b>, Dash should <b>turn to</b> your <b>voice</b> and then rush toward you.
de_de: Ziehe einen neuen Block der Kategorie <b>Wenn</b> in die Bildschirmmitte. Bearbeite den Block <b>Wenn</b>. Wenn Dash deine <b>Stimme</b><b> hört</b>, sollte er sich in die Richtung <b>drehen</b>, aus der deine <b>Stimme</b> kommt, und dann auf dich zulaufen.

source: <li>Edit The new <b>When</b> block that you drag onto the canvas so that it's <b>When Dash Hear Voice</b>. <li>Under <b>When Dash Hear Voice</b>, add a <b>Turn to Voice</b> block, then a <b>Forward</b> block.
de_de: <li>Bearbeite den neuen Block der Kategorie <b>Wenn</b>, den du in die Bildschirmmitte gezogen hast, damit daraus <b>Wenn Dash Stimme hören</b> wird. <li>Füge unter dem Block <b>Wenn Dash Stimme hören</b> einen Block der Kategorie <b>Zur Stimme drehen</b> und dann einen Block der Kategorie <b>Vorwärts</b> hinzu.

source: Now try out all your pet tricks! Tap <b>Start</b> to run the program. Then do the different actions in the <b>When</b> blocks to make your robot puppy react!
de_de: Probiere jetzt aus, ob deine ganzen Tricks mit dem Hündchen auch wirklich funktionieren. Tippe auf <b>Start</b>, um das Programm zu starten. Führe dann die unterschiedlichen Aktionen in den Blöcken der Kategorie <b>Wenn</b> durch, damit dein Roboterhündchen zeigen kann, was es gelernt hat.

source: You don't need to add, change, or delete any blocks in this step. Just tap <b>Start</b> and make Dash do the actions in the 4 stacks.
de_de: In diesem Schritt musst du keine Blöcke hinzufügen, ändern oder löschen. Tippe einfach auf <b>Start</b> und lass Dash die Aktionen aus den 4 Stapeln ausführen.

source: Dance Contest
de_de: Tanzwettbewerb
