Repository: montecab/FriProj
Catalog: po-boy/blockly/2.8.2/blockly_challenges_*.po
Languages: de_de

source: We've set the orange variable to 12. Press <b>Start</b> to see it appear on the upper left corner!
de_de: Wir haben die Orangen-Variable auf 12 gesetzt. Drücke auf <b>Start</b>, damit sie oben links angezeigt wird.

source: You don't need to add anything in this step. Just press <b>Start</b>.
de_de: In diesem Schritt musst du nichts hinzufügen. Drücke einfach nur auf <b>Start</b>.

source: The <b>Do</b> block lets you use variables in Dash's actions. This block turns on Dash's eye light <b>#12</b>, and then Dash makes a laser sound!
de_de: Beim Block <b>Ausführen</b> kannst du Variablen für die Aktionen von Dash verwenden. Dieser Block schaltet das Licht <b>#12</b> am Auge von Dash ein und Dash spielt dann einen Laser-Sound ab.

source: No need to add any blocks. Just press <b>Start</b>! Look at Dash's eye to see what happens!
de_de: Du musst keine Blöcke hinzufügen. Drücke einfach nur auf <b>Start</b>. Achte auf das Auge von Dash und sieh selbst, was nun passiert!

source: Now rearrange the blocks to make Dash turn the 11th eye light on and then make another laser sound!
de_de: Ordne die Blöcke jetzt neu an, damit Dash das 11. Licht am Auge einschaltet und erneut einen Laser-Sound abspielt.

source: The program should make the variable go from <b>12</b> to <b>11</b> in order to turn on the next light.
de_de: Das Programm sollte so eingestellt werden, dass die Variable von <b>12</b> auf <b>11</b> herunterzählt, damit das nächste Licht eingeschaltet wird.

source: Now <b>add 6 blocks</b> that will turn on the 10th and 9th eye lights after the 12th and 11th. Make Dash play the laser sound after each light comes on.
de_de: Nun musst du <b>6 Blöcke hinzufügen</b>, die nach dem 12. und 11. Augenlicht auch noch das 10. und 9. Augenlicht einschalten. Lass Dash nach jedem eingeschalteten Licht den Laser-Sound abspielen.

source: <li>Follow the pattern. Add a <b>Change by</b> block, a <b>Do</b> block, and a <b>Weird Lasers</b> block. Then do it again!<li>Make sure you edit the blocks.
de_de: <li>Gehe nach dem gleichen Muster vor. Füge einen Block der Kategorie <b>Ändern um</b>, einen Block der Kategorie <b>Ausführen</b> und einen Block der Kategorie <b>Merkwürdige Laser</b> hinzu. Wiederhole die ganzen Schritte!<li> Und vergiss nicht, die Blöcke zu bearbeiten.

source: That took a lot of work! Let's take a shortcut that will make the rest easier. <b>Connect the blocks</b> block to turn lights 12, 11, 10, and 9 on one at a time!
de_de: Puh, das hat lange gedauert! Lass uns einen kleinen Trick anwenden, damit der Rest schneller geht. <b>Verbinde die Blöcke miteinander</b>, damit die Lichter 12, 11, 10 und 9 automatisch nacheinander eingeschaltet werden.

source: You don't need to change any of the blocks. Just attach the <b>Repeat while</b> block to the stack and push <b>Start</b>!
de_de: Du musst keinen der Blöcke ändern. Füge einfach den Block <b>Wiederholen während</b> zum Stapel hinzu und drücke auf <b>Start</b>!

source: Edit the <b>Repeat while</b> block so that the variable <b>repeats while greater than 0</b>. This will make all 12 eye lights turn on one by one and make a laser sound starting from 12!
de_de: Bearbeite den Block <b>Wiederholen während</b>, damit die Variable <b>wiederholt wird, während sie größer als 0</b> ist. Dann schalten sich alle Lichter am Auge, angefangen bei dem 12. eines nach dem anderen an und spielen einen Laser-Sound ab!

source: <li>You don't need to add any blocks. Just change the value on the <b>Repeat while</b> block! <li>The <b>></b> sign means that the number on the left is greater than the number on the right.
de_de: <li>Du musst keine Blöcke hinzufügen. Ändere einfach den Wert des Blocks <b>Wiederholen während</b>! <li>Das Zeichen <b>&gt;</b> bedeutet, dass die Zahl links größer ist als die Zahl auf der rechten Seite.

source: <li>A good time bomb warns us before time is up! <b>Connect the blocks</b>. <li>Dash should say <b>Ai Yai Yai</b> for the last three eye lights and do <b>Lasers</b> for the first nine lights.
de_de: <li>Eine gute Zeitbombe warnt dich, bevor die Zeit abgelaufen ist! <b>Verbinde die Blöcke miteinander</b>. <li>Dash sollte <b>Ei, ei, ei</b> bei den letzten drei Lichtern sagen und <b>Laser-Sounds</b> bei den ersten neun Lichtern abspielen.

source: <li><b><</b> means <b>less than</b>. <li>Make sure the <b>If Else</b> block is inside the <b>Repeat while</b> block! <li>Inside the <b>Repeat while</b> loop you should have <b>Do</b>, <b>If Else</b>, then <b>Change by</b>.
de_de: <li><b>&lt;</b> bedeutet <b>Weniger als</b>. <li>Achte darauf, dass sich der Block <b>Wenn/Sonst</b> im Block <b>Wiederholen während</b> befinden muss! <li>In der Endlosschleife <b>Wiederholen während</b> solltest du <b>Ausführen</b>, <b>Wenn/Sonst</b> und dann <b>Ändern um</b> haben.

source: Now make the bomb! After time is up, make Dash start spinning in a circle while sounding the alarm with a <b>Fire Siren</b> and flashing the blue and red lights once.
de_de: Fehlt nur noch die Explosion! Lass Dash, nachdem die Zeit abgelaufen ist, sich im Kreis drehen und gleichzeitig den Alarm mit einer <b>Feuerwehrsirene</b> abspielen und jeweils einmal ein blaues und ein rotes Licht einschalten.

source: Use the <b>Set Wheel Speed</b> block to make Dash spin in circles!
de_de: Verwende den Block <b>Radgeschwindigkeit Einstellen</b>, damit Dot sich im Kreis dreht.

source: <b>Add a block</b> that makes Dash <b>repeat</b> the spin, siren, and flashing lights <b>until</b> you press the <b>top button</b>. Remember to press the <b>top button</b> after the <b>red light</b>
de_de: <b>Füge einen Block hinzu</b>, der Dash dazu bringt, die Drehung, die Sirene und das Blaulicht zu <b>wiederholen</b><b>, bis </b>du auf den <b>oberen Knopf</b> drückst. Denk dran, dass du auf den <b>oberen Knopf</b> drücken musst, nachdem das <b>rote Licht</b> aufgeleuchtet hat.

source: <li>Use a <b>Repeat until</b> block and put the Wheel speed, Transport, and Light blocks inside it. <li>Test it by pressing the top button immediately after the red light.
de_de: <li>Verwende einen Block der Kategorie <b>Wiederholen bis</b> und zieh die Blöcke für die Radgeschwindigkeit, den Transport-Sound und die Lichter hinein. <li>Teste dein Programm, indem du sofort nach dem roten Licht auf den oberen Knopf drückst.

source: Sleeping Dash Prank
de_de: Roboterschreck

source: Program your prankster sidekick Dash to suddenly come to life and randomly say one of three funny things when your victim - er, your buddy - gets too close.
de_de: Programmiere Dash so, dass er plötzlich zum Leben erwacht und zufällig einen von drei lustigen Sätzen sagt, wenn dein Opfer ... ähm, dein Kumpel ... zu nahe kommt. Das wird ein schöner Schreck!

source: Now for some mischief!
de_de: Du bist ein echtes Schlitzohr!

source: Now you have a robot prankster! What other special effects would you add when Dash pretends to wake up?
de_de: Jetzt kannst du mit deinem Roboter jemandem einen richtigen Schrecken einjagen! Was würdest du Dash noch machen lassen, wenn er plötzlich zum Leben erwacht?

source: First, put the blocks together so that Dash looks completely powered down and perfectly innocent after you hit the <b>Start</b> button.
de_de: Setze die Blöcke erst einmal zusammen, damit Dash ganz unschuldig aussieht, als hätte er keinen Saft mehr, nachdem du auf <b>Start</b> gedrückt hast.

source: You can use the <b>Eye Pattern</b> block to turn off Dash's eye lights. In this step, the lights are already turned off.
de_de: Mit dem Block <b>Augenmuster</b> kannst du die Lichter am Auge von Dash ausschalten. In diesem Schritt sind die Lichter schon ausgeschaltet.

source: Try running the program. What happens each time you put your hand in front of Dash? Notice how the value of the orange variable changes!
de_de: Versuche, das Programm zu starten. Was passiert, wenn du deine Hand vor Dash hältst? Ist dir aufgefallen, wie sich der Wert bei der Orangen-Variable ändert?

source: You don't have to add any blocks or change anything in this step. Just press the <b>Start</b> button and put your hand in front of Dash!
de_de: In diesem Schritt musst du keine Blöcke hinzufügen und auch nichts ändern. Drücke einfach nur auf <b>Start</b> und halte deine Hand vor Dash!

source: In the last step, Dash picked a random number from 0 to 100. Edit the <b>Set variable</b> block to make Dash pick a random number from <b>1 to 3</b> instead.
de_de: Im letzten Schritt hat Dash eine zufällige Zahl zwischen 0 und 100 ausgewählt. Bearbeite den Block <b>Setze Variable</b> so, dass Dash stattdessen eine zufällige Zahl zwischen <b>1 und 3</b> auswählt.

source: Tap the <b>Set variable</b> block and change the numbers under <b>choose a random number between</b>.
de_de: Tippe auf den Block <b>Setze Variable</b> und ändere die Zahlen unter <b>Zufällige Zahl auswählen zwischen</b>.

source: When Dash detects an <b>obstacle in front</b>, make Dash <b>red</b>, turn eye lights <b>on</b>, look <b>up</b>, say something, look <b>straight</b>, and then turn all lights <b>off</b> - into sleep mode.
de_de: Wenn Dash auf ein <b>Hindernis vor</b> sich stößt, lass ihn <b>rot aufleuchten</b>, die Lichter am Auge <b>einschalten</b>, nach <b>oben</b> schauen, etwas sagen, <b>geradeaus</b> schauen und dann alle Lichter am Auge <b>ausschalten</b>, damit er in den Ruhemodus versetzt wird.

source: <li>Add the new blocks after <b>Set variable = random</b>. <li>You can use the <b>My sounds</b> block to record your own sound. Examples of things that Dash might say: "What are you looking at?!" or "Can't a robot get any sleep around here?"
de_de: <li>Zieh die neuen Blöcke unter <b>Setze Variable = zufällig</b>. <li>Mit dem Block <b>Meine Sounds</b> kannst du selbst etwas aufnehmen, z. B. „Warum guckst du so?“ oder „Kann man hier nicht mal in Ruhe schlafen?“.

source: Now add an <b>If</b> block around the <b>sound</b> block. Edit the <b>If</b> block so that Dash does the sound you just recorded <b>if</b> the <b>variable = 1</b>.
de_de: Zieh nun einen Block der Kategorie <b>Wenn</b> um den Block <b>Sound</b>. Bearbeite den Block der Kategorie <b>Wenn</b> so, dass Dash den gerade von dir aufgenommenen Sound abspielt, <b>wenn</b> die <b>Variable = 1</b> ist.

source: <li>Only the <b>sound</b> block should go inside the <b>If</b> block.<li>Edit the <b>If</b> block so that the <b>variable = 1</b><li>Try it out! Tap the <b>Start</b> button and put your hand in front of Dash. When will Dash make a sound?
de_de: <li>Nur der Block <b>Sound</b> sollte in den Block <b>Wenn</b> gezogen werden. <li>Bearbeite den Block <b>Wenn</b> so, dass die <b>Variable = 1 ist</b><li> Teste dann, ob es funktioniert! Tippe auf <b>Start</b> und halte deine Hand vor Dash. Wird ein Sound abgespielt?

source: Add an <b>If</b> and a <b>My sounds</b> block below the other <b>If</b> block. Record a new sound. Make Dash do <b>sound 1</b> if the random number <b>= 1</b> and <b>sound 2</b> if the random number <b>= 2</b>.
de_de: Zieh jeweils einen Block der Kategorie <b>Wenn</b> und einen Block der Kategorie <b>Meine Sounds</b> unter den anderen Block der Kategorie <b>Wenn</b>. Nimm einen neuen Sound auf. Lass Dash <b>Sound 1</b> abspielen, wenn als Zahl zufällig <b>= 1</b> ausgewählt wird und <b>Sound 2</b>, wenn als Zahl zufällig <b>= 2</b> ausgewählt wird.

source: <li>Need more ideas for funny responses? How about "Back away slowly, fella!" or "I was dreaming of electric sheep!"<li>Only the <b>sound</b> block should go inside the <b>If</b> block.<li>The <b>Look straight</b>, <b>All Lights black</b>, and <b>Eye Pattern All off</b> blocks should be at the bottom of your program.
de_de: <li>Hier sind noch ein paar Ideen für lustige Antworten: „Sieh zu, dass du Land gewinnst, mein Freund!“ oder „Ich habe von elektrischen Schafen geträumt!“. <li> Achte darauf, dass du nur den Block <b>Sound</b> in den Block <b>Wenn</b> ziehst. <li>Die Blöcke <b>Schauen geradeaus</b>, <b>Alle Lichter schwarz</b> und <b>Augenmuster Alle aus </b>sollten unter deinem Programm sein.

source: <b>Add to the program</b>. Make Dash do <b>weird beeps</b> if the random number <b>= 3</b>!
de_de: <b>Füge nun eine weitere Aktion zum Programm hinzu</b>. Lass Dash <b>komische Pieptöne</b> von sich geben, wenn die zufällige Zahl <b>= 3</b> ist!

source: <li>After you finish this step, you should have 3 <b>If</b> blocks and 3 sounds.<li>Remember to keep the <b>Look straight</b>, <b>All lights black</b>, and <b>Eye Pattern All off</b> blocks at the bottom of your program.
de_de: <li>Nachdem du diesen Schritt abgeschlossen hast, solltest du 3 Blöcke der Kategorie <b>Wenn</b> und 3 Sounds haben. <li>Denk dran, dass du die Blöcke <b>Schauen geradeaus</b>, <b>Alle Lichter schwarz</b> und <b>Augenmuster Alle aus</b> unter dein Programm ziehen musst.

source: Farm Animal Noise Machine
de_de: Tiere auf dem Bauernhof

source: Use <strong>variables</strong> to turn Dash into a farm animal noise machine! Dash will make a different animal sound when you move Dash's head up, down, left, and right!
de_de: Verwende <strong>Variablen</strong>, um Dash verschiedene Bauernhoftiere nachahmen zu lassen. Dash macht jedes Mal ein anderes Geräusch, wenn du seinen Kopf nach oben, unten, links oder rechts bewegst!

source: And there you have it!
de_de: Und schon bist du fertig!

source: Your very own farm animal noise machine that you can play by turning Dash's head. Explore the other senses Dash has. Can you make Dash make different noises based on how far your hand is from Dash's distance sensor?
de_de: Du hast deinen eigenen Stimmengenerator für Bauernhoftiere erstellt. Steuern lassen sich die einzelnen Tierstimmen, indem du den Kopf von Dash in verschiedene Richtungen bewegst. Schau dir auch die anderen Sinne von Dash an. Schaffst du es, Dash so zu programmieren, dass er je nach Abstand deiner Hand zum Abstandssensor einen anderen Sound abspielt?

source: Tap <b>Start</b> and use your hands to turn Dash's head left and right. Does the variable in the upper left corner of the screen change?
de_de: Tippe auf <b>Start</b> und verwende dann deine Hände, um den Kopf von Dash nach links und rechts zu drehen. Ändert sich die Variable in der oberen linken Ecke des Bildschirms?

source: You don't need to add any blocks. Just tap <b>Start</b> and use your hands to turn Dash's head! You can see the variable change on the screen in the top left corner.
de_de: Du musst keine Blöcke hinzufügen. Tippe einfach nur auf <b>Start</b> und verwende deine Hände, um den Kopf von Dash in verschiedene Richtungen zu bewegen. Oben links auf dem Bildschirm siehst du, wie sich die Variable ändert.

source: Dash can go from 135 to -135 degrees when looking right to left. Make Dash's lights <b>blue</b> when you turn Dash's head <b>right</b> and <b>red</b> when you turn Dash's head <b>left</b>.
de_de: Dash kann seinen Kopf von 135 bis -135 Grad drehen, wenn er von rechts nach links schaut. Lass Dash <b>blau</b> aufleuchten, wenn du seinen Kopf nach <b>rechts</b> drehst und lass ihn <b>rot</b> aufleuchten, wenn du seinen Kopf nach <b>links</b> drehst.

source: <li>When Dash looks right, Dash's head angle is a <b>positive</b> number. When Dash looks left, Dash's head angle is a <b>negative</b> number. <li>Press <b>Start</b> and then turn Dash's head back and forth to watch the colors change!
de_de: <li>Wenn Dash nach rechts schaut, ist der Winkel seines Kopfs eine <b>positive</b> Zahl. Wenn Dash nach links schaut, ist der Winkel seines Kopfs eine <b>negative</b> Zahl. <li>Drücke auf <b>Start</b> und drehe den Kopf von Dash vor und zurück, um zu sehen, wie sich die Farben ändern!

source: Now add sounds! Make Dash <strong>meow like a cat</strong> when you turn Dash's head right and <strong>bark like a dog</strong> when you turn Dash's head left!
de_de: Es fehlen noch ein paar coole Tierstimmen! Lass Dash <strong>miauen wie eine Katze</strong>, wenn du seinen Kopf nach rechts drehst, und <strong>bellen wie ein Hund</strong>, wenn du seinen Kopf nach links drehst.

source: <li>Add <b>Sound</b> blocks under the <b>Light</b> blocks. <li>The cat sound goes with the blue lights, and the dog sound goes with the red lights.
de_de: <li>Zieh die Blöcke für den <b>Sound</b> unter die Blöcke für das <b>Licht</b>. <li>Du musst den Katzen-Sound dem blauen Licht und den Hunde-Sound dem roten Licht zuordnen.

source: Add a block that <b>sets</b> the banana variable to Dash's <b>Look Up/Down Angle</b>. Press <b>Start</b> and tilt Dash's head up and down with your hand to watch the numbers change.
de_de: Füge nun einen Block hinzu, mit dem die Bananen-Variable auf Dashs <b>Winkel beim Hoch-/Runterschauen</b><b> gesetzt</b> wird. Drücke auf <b>Start</b> und neige den Kopf von Dash mit deiner Hand nach oben und unten, um zu sehen, wie sich die Zahlen ändern.

source: <li>Add the new block inside the <b>Repeat forever</b> loop but below the <b>If</b> block!<li>You can edit the <b>Set</b> block to make it work with Dash's Look Up/Down Angle.
de_de: <li>Zieh den neuen Block in die Schleife <b>Endlos Wiederholen</b>, aber unter den Block <b>Wenn</b>!<li> Du kannst den Block <b>Einstellen</b> bearbeiten, damit diese Programmierung mit Dashs Winkel beim Hoch-/Runterschauen funktioniert.

source: Add a new <b>If Else</b> block. Program Dash to turn <b>yellow</b> and roar when you move Dash's head up. Program Dash to turn <b>green</b> and bah when you move Dash's head down!
de_de: Füge einen neuen Block der Kategorie <b>Wenn/Sonst</b> hinzu. Programmiere Dash so, dass er <b>gelb</b> aufleuchtet und brüllt wie ein Löwe, wenn du seinen Kopf nach oben bewegst. Programmiere Dash so, dass er <b>grün</b> aufleuchtet und „Mäh“ macht, wenn du seinen Kopf nach unten bewegst!

source: <li>The lion and goat blocks should be inside the new <b>If Else</b> block, which should be under the <b>Set banana variable</b>.<li>Remember to use the <b>yellow banana variable</b> in your new <b>If Else</b> block.
de_de: <li>Die Blöcke für den Löwen- und den Ziegen-Sound sollten sich im neuen Block der Kategorie <b>Wenn/Sonst</b> befinden, den du unter <b>Setze Bananen-Variable</b> ziehen musst. <li>Denk dran, die <b>gelbe Bananen-Variable</b> in deinem nächsten Block <b>Wenn/Sonst</b> zu verwenden.

source: Dot seriously needs to learn to drive. Do you think you can teach Dot to drive safely around the neighborhood?
de_de: Dot muss jetzt endlich lernen, wie man fährt. Kannst du Dot beibringen, sicher durch die Nachbarschaft zu fahren?

source: Fantastic! Dot is now licensed to drive!
de_de: Fantastisch! Dot hat jetzt den Führerschein!

source: Press the <b>Start</b> button in the bottom left corner to get Dot's engine going!
de_de: Drücke auf <b>Start</b> unten links, um den Motor von Dot zu starten!

source: <li>Drag the <b>Truck Horn</b> block and stack it under the <b>Car Engine</b> block so Dot can honk the horn. <li>Tap <b>Start</b> to run the program.
de_de: <li>Zieh den Block <b>LKW-Hupe</b> unter den Block <b>Automotor</b>, damit Dot hupen kann. <li>Tippe auf <b>Start</b>, um das Programm auszuführen.

source: <li>It's time to hit the gas! Stack the <b>Car Tire Squeal</b> sound under the green <b>When Dot Top Button</b> block.<li>Tap <b>Start</b> and <b>push Dot's top button</b> to test the program.
de_de: <li>Jetzt geben wir ordentlich Gas! Zieh den Sound <b>Reifenquietschen</b> unter den grünen Block <b>Wenn Dot Oberer Knopf</b>.<li>Tippe auf <b>Start</b> und drücke auf den <b>oberen Knopf von Dot</b>, um das Programm zu testen.

source: In the menu on the left, tap <b>Sound</b> and drag <b>Say Hi</b> to the canvas. Stack it under the <b>Car Tire Squeal</b>.
de_de: Tippe im Menü auf der linken Seite auf <b>Sound</b> und zieh <b>Sag Hallo</b> in die Bildschirmmitte. Zieh diese Aktion unter das <b>Reifenquietschen</b>.

source: Dot should be more excited! Tap the <b>Say Hi</b> block to edit it. Change it so that Dot says <b>Wee!</b> You may need to scroll down to find the <b>Wee!</b> sound.
de_de: Dot darf ruhig ein bisschen mehr Freude zeigen! Tippe auf den Block <b>Sag Hallo</b>, um ihn zu bearbeiten. Ändere den Block, damit Dot <b>Hui!</b> sagt. Du musst ein bisschen nach unten scrollen, um den Sound <b>Hui!</b> zu finden.

source: Angry Robot Joke
de_de: Spaßroboter

source: Dot is already pretty funny, but here's a joke you can use to transform Dot into a robot comedian.
de_de: Dot ist zwar schon von Natur aus ziemlich lustig, doch mit einem Witz kannst du sie in einen richtigen Roboter-Spaßvogel verwandeln.

source: Ha ha ha! Just kidding.
de_de: Ha, ha, ha! War nur Spaß!

source: Get it? Now you have a joke-telling robot. What other jokes can you program Dot to tell?
de_de: Cool, oder? Du hast nun einen Roboter, der Witze erzählen kann. Welche anderen Witze kannst du Dot noch erzählen lassen?

source: Edit the <b>Eye Pattern</b> block to give Dot a smile. You can edit the block by tapping on it.
de_de: Bearbeite den Block <b>Augenmuster</b>, um Dot lächeln zu lassen. Du kannst den Block bearbeiten, indem du ihn antippst.

source: To edit the <b>Eye Pattern</b>, tap on the block. Then you can tap on each eye light to turn it off or on.
de_de: Um das <b>Augenmuster</b> zu bearbeiten, musst du den Block antippen. Du kannst dann jedes einzelne Licht am Auge antippen, um es ein- oder auszuschalten.

source: Add a <b>My sounds</b> block to the program. Use it to record your own voice saying the first line: <b>Why was the robot angry?</b>
de_de: Füge einen Block der Kategorie <b>Meine Sounds</b> zum Programm hinzu. Verwende diesen Block, um aufzunehmen, wie du den folgenden Satz sagst: <b>Was sagt ein Roboter an der Tankstelle?</b>

source: <li>You can find the <b>My sounds</b> block in the <b>Sound</b> section of the menu on the left.<li>Add the new <b>My sound</b> block below the <b>Eye Pattern</b> block. <li>Use <b>My sounds #1</b>. Tap it and follow the instructions to record a new sound.
de_de: <li>Du findest den Block <b>Meine Sounds</b> im Abschnitt <b>Sound</b> im Menü auf der linken Seite. <li>Zieh den neuen Block der Kategorie <b>Meine Sounds</b> unter den Block <b>Augenmuster</b>. <li>Verwende <b>Meine Sounds #1</b>. Tippe auf den Block und halte dich an die Anweisungen, um einen neuen Sound aufzunehmen.

source: Add a new <b>My sounds</b> block under the <b>When Dot Top Button</b> block. Use <b>slot #2</b> to record the second line of the joke: <b>Because someone kept pushing its buttons!</b>
de_de: Zieh einen neuen Block der Kategorie <b>Meine Sounds</b> unter den Block <b>Wenn Dot Oberer Knopf</b>. Verwende <b>Slot #2</b>, um den zweiten Satz des Witzes aufzunehmen: <b>Nimm deinen Finger aus dem Ohr, wir müssen reden!</b>

source: <li>Add a new <b>My sounds</b> block. Put it under the green <b>When Dot Top Button</b> block. <li>Use <b>My sounds #2</b> for the second line of the joke.
de_de: <li>Füge einen neuen Block der Kategorie <b>Meine Sounds</b> hinzu. Zieh ihn unter den grünen Block <b>Wenn Dot Oberer Knopf</b>. <li>Verwende <b>Meine Sounds #2</b> für den zweiten Satz des Witzes.

source: Robot Kitten
de_de: Roboterkätzchen

source: Can you transform Dot into a kitten? No kitty litter required!
de_de: Kannst du Dot in ein Kätzchen verwandeln? Du brauchst auch kein Katzenklo, versprochen!

source: Here, kitty kitty!
de_de: Maunzbot

source: You've trained your robot kitten! What else can you train your pet to do using <b>When</b> blocks?
de_de: Du hast dein Roboterkätzchen gut erzogen! Was kannst du deinem Haustier mit Blöcken der Kategorie <b>Wenn</b> noch alles beibringen?
