Repository: montecab/FriProj
Catalog: po-boy/blockly/2.8.2/blockly_challenges_*.po
Languages: de_de

source: <li>The <b>Dance Dot</b> animation has 3 options: Happy, Silly, and Celebrate. We're going to use <b>Happy</b> in this program. You'll see why.<li>Be sure to choose <b>Dot</b> in the <b>Dance</b> block.
de_de: <li>In der Animation <b>Tanzen Dot</b> gibt es 3 Optionen: Glücklich, Albern und Freudentanz. In diesem Programm werden wir <b>Glücklich</b> benutzen. Du wirst gleich sehen, wieso.<li>Achte darauf, dass du <b>Dot</b> im Block <b>Tanzen</b> auswählst.

source: Edit the green <b>When</b> block. Change it to <b>When Dot Shake</b>. Then connect the blocks so that <b>when Dot shakes</b>, the orange variable will be set <b>randomly to 1 or 2</b>.
de_de: Bearbeite den grünen Block <b>Wenn</b>. Ändere ihn zu <b>Wenn Dot Schütteln</b>. Verbinde dann die Blöcke, sodass die Orangen-Variable <b>zufällig auf 1 oder 2 eingestellt wird, </b><b>wenn Dot geschüttelt wird</b>.

source: <li>Don't edit the <b>Set variable</b> block. Just stack it under the <b>When Dot Shake</b> block.<li>When you run the program, <b>shake Dot</b> and watch the orange variable on the top left corner of your screen.
de_de: <li>Ändere nichts an dem Block <b>Setze Variable</b>. Füge ihn einfach unter dem Block <b>Wenn Dot Schütteln</b> an.<li>Wenn du das Programm startest, <b>schüttele Dot</b> und beobachte die Orangen-Variable in der linken oberen Ecke deines Bildschirms.

source: Stack the <b>If</b> loop under the <b>Set</b> block so that <b>if the variable = 1</b>, Dot will make <b>My sound #1</b>. Record your own voice saying <b>Naughty!</b>
de_de: Füge die Schleife <b>Wenn</b> unter dem Block <b>Setze</b> an, damit Dot <b>Mein Sound #1</b> abspielt, <b>wenn die Variable = 1</b> ist. Mach eine Aufnahme von deiner eigenen Stimme und sag <b>„Böse!“.</b>

source: <li>Tap the <b>My sounds</b> block to change it. Use <b>Slot #1</b> to record your own voice saying <b>Naughty!</b><li>You don't need to edit any of the blue blocks.<li>Stack the <b>If</b> loop under the <b>Set</b> block.
de_de: <li>Tippe den Block <b>Mein Sound</b> an, um ihn zu bearbeiten. Benutze <b>Slot #1</b>, um eine Aufnahme deiner eigenen Stimme zu machen und sage <b>„Böse!“.</b><li>Du brauchst keinen der blauen Blöcke zu bearbeiten.<li>Füge die Schleife <b>Wenn</b> unter dem Block <b>Setze</b> an.

source: Add new blocks to the program so that <b>if the variable = 2</b>, Dot will say <b>Nice!</b> Use another <b>My sounds</b> block to record your own voice saying <b>Nice!</b>
de_de: Füge dem Programm neue Blöcke hinzu, sodass Dot <b>„Brav!“</b> sagt, <b>wenn die Variable = 2 ist.</b> Benutze einen weiteren Block der Kategorie <b>Meine Sounds</b>, um aufzunehmen, wie du <b>„Brav!“ sagst.</b>

source: <li>Put a new <b>My sounds</b> block inside a new <b>If</b> block to create a loop.<li>Make sure the new <b>If</b> block is set to <b>If orange variable = 2</b>. <li>Use <b>My sounds #2</b> to record yourself saying <b>Nice!</b>
de_de: <li>Füge einen neuen Block der Kategorie <b>Meine Sounds</b> zu einem neuen Block der Kategorie <b>Wenn</b> hinzu, um eine Schleife zu erstellen.<li>Programmiere den neuen Block der Kategorie <b>Wenn</b> folgendermaßen: <b>Orangen-Variable = 2</b>. <li>Benutze <b>Meine Sounds #2</b>, um eine Aufnahme deiner Stimme zu machen und sage <b>„Brav!“.</b>
