Repository: montecab/FriProj
Catalog: po-boy/blockly/2.8.2/blockly_challenges_*.po
Languages: de_de

source: Connect the blocks. Change the <b>Eye Pattern</b> block to give Dot <b>whiskers</b> using the eye lights. You can do the whiskers any way you want, so use your imagination.
de_de: Verbinde die Blöcke miteinander. Bearbeite den Block <b>Augenmuster</b>, um Dot mit den Lichtern am Auge <b>Schnurrhaare</b> zu verpassen. Lass deiner Fantasie beim Erstellen der Schnurrhaare freien Lauf.

source: <li>Tap the <b>Eye Pattern</b> block to edit it.<li>Tap each light to turn it on or off.
de_de: <li>Tippe auf den Block <b>Augenmuster</b>, um ihn zu bearbeiten.<li>Tippe jedes einzelne Licht am Auge an, um es ein- oder auszuschalten.

source: Add a <b>Sound</b> block to make Dot say <b>Sigh</b> whenever you press the <b>Top Button</b>, as if you were petting your kitten.
de_de: Füge einen <b>Sound</b>-Block hinzu, damit Dot einen <b>Seufzer</b> ausstößt, wenn du auf den <b>Oberen Knopf</b> drückst – ganz so, als würdest du dein schnurrendes Kätzchen streicheln.

source: <li>Use the <b>Say Hi</b> block in the <b>Sound</b> section of the menu on the left. <li>Edit the <b>Say Hi</b> block so that Dot says <b>Sigh</b>.<li>Stack the <b>Sigh</b> block under the <b>When Dot Top Button</b> block.<li>Keep the stacks separate. You <b>don't</b> need to combine the two stacks into one stack.
de_de: <li>Verwende den Block <b>Sag Hallo</b> im Abschnitt <b>Sound</b> im Menü auf der linken Seite. <li>Bearbeite den Block <b>Sag Hallo</b> so, dass Dot <b>Seufz</b> sagt. <li>Zieh den Block <b>Seufz</b> unter den Block <b>Wenn Dot Oberer Knopf</b>.<li>Lass die Stapel getrennt, sie müssen <b>nicht</b> zu einem Stapel verbunden werden.

source: Add a new <b>When</b> block to the canvas and change it to <b>When Dot Hear Clap</b>. Add a block below it to make Dot <b>meow like a cat</b> whenever someone claps.
de_de: Zieh einen neuen Block der Kategorie <b>Wenn</b> in die Bildschirmmitte und ändere ihn zu <b>Wenn Dot Klatschen hören</b>. Zieh einen Block darunter, damit Dot <b>miaut wie eine Katze</b>, sobald jemand klatscht.

source: <li>Drag another <b>When Dash Top Button</b> block to the canvas. Tap it to edit it. Change <b>Top Button</b> to <b>Hear Clap</b>.<li>Add an <b>Animal sound</b> block below <b>When Dash Hear Clap</b>. Change the animal sound from Horse to <b>Cat</b>. <li>Make sure Dot is selected instead of Dash.<li>You <b>don't</b> need to connect the 3 stacks together. Leave them as separate stacks.
de_de: <li>Zieh einen weiteren Block der Kategorie <b>Wenn Dash Oberer Knopf</b> in die Bildschirmmitte. Tippe ihn an und ändere <b>Oberer Knopf</b> zu <b>Klatschen hören</b>.<li>Zieh einen Block der Kategorie <b>Tier-Sound</b> unter <b>Wenn Dash Klatschen hören</b>. Ändere den Tier-Sound von Pferd zu <b>Katze</b>. <li>Achte darauf, dass Dot ausgewählt ist. <li>Du musst die 3 Stapel <b>nicht</b> miteinander verbinden. Lass sie einfach separat stehen.

source: Now play with your new kitten. Try everything out by <b>pushing the top button</b> and <b>clapping</b>.
de_de: Jetzt kannst du mit deinem neuen Kätzchen spielen. Probier alles aus, indem du <b>auf den oberen Knopf drückst</b> und <b>klatschst</b>.

source: Space Bot Dot
de_de: Weltraum-Roboter Dot

source: Transform Dot into a space bot that has to fly through an asteroid belt!
de_de: Verwandle Dot in einen Weltraumroboter und lass sie durch einen Asteroidengürtel fliegen!

source: You survived!
de_de: Du hast überlebt!

source: You made it through the asteroid belt! What else can you program your space bot to do by turning Dot in other positions?
de_de: Du hast es durch den Asteroidengürtel geschafft! Was kannst du deinem Weltraumroboter noch alles beibringen, indem du Dot in andere Positionen bringst?

source: Dot loves to fly! Stack the blocks together under <b>When Dot Move</b> to make Dot turn white and say <b>Wee!</b> while moving. End with <b>Go to Start</b> to make the program repeat.
de_de: Dot liebt es zu fliegen. Stapele die Blöcke unter <b>Wenn Dot Bewegung</b>, um Dot weiß aufleuchten und <b>Hui!</b> sagen zu lassen, während sie sich bewegt. Beende das Programm mit <b>Zum Start gehen</b>, damit es sich wiederholt.

source: <b>Move Dot with your hands</b> to test the program.
de_de: <b>Bewege Dot mit deinen Händen</b>, um das Programm zu testen.

source: Make Dot lean right to avoid asteroids! Add new blocks to make Dot turn <b>red</b> and say <b>Uh oh!</b> while <b>leaning right</b>. Add a <b>Go to Start</b> at the end to repeat.
de_de: Lass Dot sich nach rechts lehnen, um Asteroiden auszuweichen! Füge neue Blöcke hinzu, damit Dot <b>rot</b> aufleuchtet und <b>Oh, oh!</b> sagt, während sie sich nach <b>rechts lehnt</b>. Füge am Ende <b>Zum Start gehen</b> hinzu, damit sich das Programm wiederholt.

source: <li>Add new blocks under <b>When Dot Lean Right</b> in this order: All Lights Red, Say Uh-oh!, and Go to Start.
de_de: <li>Füge neue Blöcke unter <b>Wenn Dot Nach rechts lehnen</b> hinzu, und zwar in dieser Reihenfolge: Alle Lichter Rot, Sag Oh, oh! und Zum Start gehen.

source: Make Dot lean left. Edit the new <b>When</b> block and add new blocks so that when Dot <b>leans left</b>, Dot turns <b>red</b> and says <b>Ay Yai Yai</b>. End with a <b>Go to Start</b> block.
de_de: Lass Dot sich nach links lehnen. Bearbeite den neuen Block der Kategorie <b>Wenn</b> und füge neue Blöcke hinzu, damit Dot, wenn sie <b>sich nach links lehnt</b>, <b>rot</b> aufleuchtet und <b>Ei ei ei! </b>sagt. Schließe das Programm mit einem Block <b>Zum Start gehen</b> ab.

source: <li>Tap the <b>When Dot Top Button</b> block to edit it. Change <b>Top Button</b> to <b>Lean Left</b>.<li>Under the <b>When Dot Lean Left</b> block, add the other new blocks.<li>Test the program by <b>moving</b> Dot and <b>leaning</b> Dot <b>left</b> and <b>right</b>
de_de: <li>Tippe auf den Block <b>Wenn Dot Oberer Knopf</b>, um ihn zu bearbeiten. Ändere <b>Oberer Knopf</b> zu <b>Nach links lehnen</b>. <li>Zieh die anderen neuen Blöcke unter den Block <b>Wenn Dot Nach links lehnen</b>. <li>Teste das Programm, indem du Dot <b>bewegst</b> und sie sich nach <b>links</b> und <b>rechts</b> lehnen<b> lässt.</b>

source: Friendly Robot
de_de: Bitte lächeln!

source: Use <b>functions</b> to transform Dot from a grump into a friendly robot!
de_de: Verwende <b>Funktionen</b>, um aus der schlecht gelaunten Dot einen freundlichen Roboter zu machen.

source: That is one friendly robot!
de_de: So ein freundlicher Roboter!

source: That's how you put the <b>fun</b> in functions! Can you create a second function so that your friendly robot <b>turns different colors</b> after saying <b>Hi</b>?
de_de: So erstellst du <b>lustige</b> Funktionen! Kannst du noch eine zweite Funktion programmieren, damit dein freundlicher Roboter <b>in verschiedenen Farben aufleuchtet</b>, nachdem er <b>Hallo</b> gesagt hat?

source: Add a new block under <b>When Dot Top Button</b> so that Dot says <b>Hi</b> when you press the <b>top button</b>.
de_de: Zieh einen neuen Block unter <b>Wenn Dot Oberer Knopf</b>, damit Dot <b>Hallo</b> sagt, sobald du auf den <b>oberen Knopf</b> drückst.

source: Now add the stack of <b>Eye Pattern</b> blocks under the <b>When Dot Top Button</b> block so Dot does the eye pattern <b>before</b> saying <b>Hi</b>. <b>Don't</b> change the eye patterns.
de_de: Zieh nun den Stapel mit den Blöcken der Kategorie <b>Augenmuster</b> unter den Block <b>Wenn Dot Oberer Knopf</b>, damit Dot das Augenmuster anzeigt, <b>bevor</b> sie <b>Hallo</b> sagt. Ändere die Augenmuster <b>nicht!</b>

source: <li>Don't rearrange or change the <b>Eye Pattern</b> blocks. <li>Move them so that they are between <b>When Dot Top Button</b> and <b>Say Hi</b>.
de_de: <li>Du musst die Blöcke für die <b>Augenmuster</b> nicht neu anordnen oder ändern. <li>Verschiebe sie einfach, damit sie sich zwischen <b>Wenn Dot Oberer Knopf</b> und <b>Sag Hallo</b> befinden.

source: Let's improve the program with <b>functions</b>. We've put Dot's smile and greeting into a function we named <b>Bloop</b>. Stack the <b>Call Bloop</b> block under <b>When Dot Top Button</b>.
de_de: Wir können unser Programm mit ein paar tollen <b>Funktionen</b> noch weiter verbessern. Mit einer Funktion, die wir <b>Bloop</b> genannt haben, kann Dot lächeln und andere grüßen. Zieh den Block <b>Abruf Bloop</b> unter <b>Wenn Dot Oberer Knopf</b>.

source: <li>You can put a <b>function</b> into your program to <b>replace</b> of all the blocks that make up that function. <li>You can use <b>more than one</b> function in a program, but for this program we'll just use one.
de_de: <li>Du kannst eine <b>Funktion</b> zu deinem Programm hinzufügen, um alle Blöcke zu <b>ersetzen</b>, die diese Funktion bilden. <li>Du kannst <b>mehr als eine</b> Funktion in einem Programm verwenden. Aber in diesem Programm beschränken wir uns auf eine Funktion.

source: You can name functions anything. Tap the <b>Function Bloop</b> block to edit it. Call it <b>Greet</b>. You can see that the name automatically changes in the <b>Call</b> block.
de_de: Du kannst Funktionen beliebige Namen geben. Tippe auf den Block <b>Funktion Bloop</b>, um ihn zu bearbeiten. Ändere die Bezeichnung auf <b>Greet</b>. Du siehst, dass der Name im Block <b>Abruf</b> automatisch geändert wurde.

source: Disco Ball
de_de: Diskokugel

source: Dot's got a disco attitude but needs some fancy moves to match! Can you turn Dot into a disco ball?
de_de: Dot ist wie für die Disco gemacht, aber ihr fehlen noch ein paar flotte Tanzbewegungen. Kannst du Dot in eine Discokugel verwandeln?

source: Oooh, aahh, lights!
de_de: Oooh, aahh, es werde Licht!

source: Now that Dot is lighting up the dance floor, can you add sounds to the program?
de_de: Kannst du auch Sounds zum Programm hinzufügen, nun, da Dot die Tanzfläche zum Glühen bringt?

source: Stack the blocks under <b>When Start</b> so that Dot turns orange, green, and purple.
de_de: Zieh die Blöcke unter <b>Wenn Start</b>, damit Dot orange, grün und lila aufleuchtet.

source: Use functions to improve the program. Drag the <b>lights</b> into the <b>Function Colors</b> loop. Put the <b>Call Colors</b> block under <b>When Start</b>. Now the light show is a function.
de_de: Verwende Funktionen, um das Programm zu verbessern. Zieh die <b>Lichter</b> in die Schleife <b>Funktion Farben</b>. Zieh den Block <b>Abruf Farben</b> unter <b>Wenn Start</b>. Jetzt ist die Lichtershow eine Funktion.

source: <li>The 3 <b>light blocks</b> should go inside the <b>Function Colors</b> block.<li>The <b>Call Colors</b> block should go under <b>When Start</b>.
de_de: <li>Die 3 Blöcke für die <b>Lichter</b> sollten sich im Block <b>Funktion Farben</b> befinden.<li>Den Block <b>Abruf Farben</b> musst du unter <b>Wenn Start</b> ziehen.

source: Where can you put the <b>Repeat Forever</b> block to make the colors repeat forever?
de_de: Wohin kannst du den Block <b>Endlos Wiederholen</b> ziehen, damit die Farben in Endlosschleife wiederholt werden?

source: <li>Make sure the <b>Call Colors</b> block is inside the <b>Repeat forever</b> loop.
de_de: <li>Achte darauf, dass sich der Block <b>Abruf Farben</b> in der Schleife <b>Endlos wiederholen</b> befindet.

source: Magic Dot Ball
de_de: Magische Zauberkugel

source: Can you turn Dot into a fortune teller using only 3 blocks?
de_de: Kannst du aus Dot mit nur 3 Blöcken eine Wahrsagerin machen?

source: Magic Dot Ball: Get!
de_de: Die magische Zauberkugel ist bereit!

source: Now you've got your very own spherical oracle. Try it out with your family or friends!
de_de: Jetzt hast du deine eigene Zauberkugel. Probier sie gleich mal mit deiner Familie oder deinen Freunden aus!

source: Tap the <b>My sounds</b> block and record <b>10 different responses</b> to yes or no questions about the future.
de_de: Tippe auf den Block <b>Meine Sounds</b> und nimm <b>10 unterschiedliche Antworten</b> auf Ja- und Nein-Fragen über die Zukunft auf.

source: <li>Record a different sound for each slot, from 1 to 10.<li>Make sure you record a variety of responses, like <b>No way!</b> and <b>Absolutely</b>, and <b>Maybe</b>.<li>Remember to transfer each sound to your robot by tapping the <b>green check mark</b>.
de_de: <li>Speichere in jedem Slot von 1 bis 10 eine andere Aufnahme. <li>Achte darauf, dass du verschiedene Antworten aufnimmst, zum Beispiel <b>Auf keinen Fall!</b>, <b>Ganz sicher</b> und <b>Vielleicht</b>.<li>Vergiss nicht, jeden Sound auf deinen Roboter zu übertragen, indem du auf das <b>grüne Häkchen</b> tippst.

source: Edit the <b>My sounds</b> block. Select <b>Random</b> so that Dot plays a random sound each time you press the <b>Top Button</b>.
de_de: Bearbeite den Block <b>Meine Sounds.</b> Wähle <b>Zufällig</b> aus, damit Dot einen zufälligen Sound abspielt, wenn du den <b>oberen Knopf </b>drückst.

source: <li>When you are editing the <b>My sounds</b> block, scroll through the numbers to the bottom. That's where you will find <b>Random</b>.<li>Test the program by tapping <b>Start</b> and then pushing Dot's top button.
de_de: <li>Wenn du den <b>Block</b> Meine Sounds bearbeitest, scrolle ganz bis nach unten weiter. Dort findest du <b>Zufällig</b>.<li>Teste das Programm, indem du auf <b>Start</b> tippst und dann Dots oberen Knopf drückst.

source: Now let's change the program so that Dot responds when you <b>shake Dot</b> instead of when you press the top button.
de_de: Versuchen wir jetzt mal, das Programm so zu bearbeiten, dass Dot reagiert, wenn du <b>Dot schüttelst</b> und nicht, wenn du den oberen Knopf drückst.

source: <li>Tap the <b>When Dot Top Button</b> block to edit it.<li>Find the icon for <b>Shake</b>.<li>Make sure you've selected <b>Dot</b> instead of <b>Dash</b>.
de_de: <li>Tippe auf den <b>Block</b> Wenn Dot Oberer Knopf, um diesen zu bearbeiten. <li>Finde das Symbol für <b>Schütteln</b>. <li>Achte darauf, dass du <b>Dot</b> und nicht <b>Dash</b> ausgewählt hast.

source: Robot Rescue
de_de: Roboter-Rettungsaktion

source: You come across a <b>robot</b> that needs to be recharged. By <b>clapping</b>, you can charge the robot one <b>eye light</b> at a time.
de_de: Du begegnest einem <b>Roboter,</b> der neu aufgeladen werden muss. Indem du <b>in die Hände klatschst</b>, kannst du den Roboter <b>Augenleuchte</b> um Augenleuchte neu aufladen.

source: You've recharged the robot! What other games can you make up using Dot's eye lights and variables?
de_de: Du hast den Roboter neu aufgeladen! Welche anderen Spiele kannst du dir einfallen lassen, bei denen du Dots Augenlichter und Variablen verwendest?

source: Add <b>2 blocks</b> to the program so that when you press <b>Start</b>, Dot's lights are <b>dark</b> and the <b>Eye Pattern</b> is <b>all off</b>. Dot will appear to be turned off.
de_de: Füge dem Programm <b>2 Blöcke</b> hinzu, sodass Dots Lichter <b>dunkel</b> werden und das <b>Augenmuster</b><b> ganz aus</b> ist, wenn du auf <b>Start</b> drückst. Dot sieht dann so aus, als wäre sie ausgeschaltet.

source: <li>How can you edit an <b>Eye Pattern</b> block to make it look like Dot's lights are turned off?<li>How can you use an <b>All Lights</b> block to make it look like Dot's lights are off?
de_de: <li>Wie kannst du den Block <b>Augenmuster</b> so bearbeiten, dass es scheint, als ob Dots Lichter ausgeschaltet sind?<li>Wie kannst du den Block <b>Alle Lichter</b> benutzen, damit es so scheint, als wären Dots Lichter alle aus?

source: Edit the <b>Change variable</b> block so that a <b>clap</b> will make the variable <b>change by +1</b>. Clap to test. Watch the <b>orange variable</b> on your screen go up.
de_de: Bearbeite den Block <b>Variable ändern</b> so, dass ein <b>Klatschen </b>die Variable <b>um +1 ändert</b>. Klatsche in die Hände, um es zu testen. Auf deinem Bildschirm siehst du, wie <b>die Orangen-Variable</b> steigt.

source: <li>To edit the <b>Change variable</b> block, just change the <b>+ 0</b> to a <b>+ 1</b>. </b> <li>If you tap Dot gently with a pen, Dot will think it sounds like a clap.
de_de: <li>Um den Block <b>Variable ändern</b> zu bearbeiten, ändere einfach <b>+0</b> zu <b>+1</b>. </b> <li>Wenn du Dot leicht mit einem Kulli auf den Kopf tippst, denkt sie, dass jemand in die Hände klatscht.

source: Add the <b>Do</b> <b>Drive</b> block under the <b>Change by</b> block. Edit the <b>Do</b> <b>Drive</b> block so that an <b>eye light turns on</b> each time you clap.
de_de: Ziehe den Block <b>Aktion</b> <b>Fahrt</b> unter den Block <b>Ändern um</b> . Bearbeite den Block <b>Aktion</b> <b>Fahrt</b>, damit jedes Mal<b> eine Augenleuchte aktiviert wird</b>, wenn du in die Hände klatschst.

source: <li>Tap the <b>Do</b> <b>Drive</b> block to edit it.<li>Select <b>Eye Light On</b> from the list of actions.<li>Keep using the <b>orange</b> variable.
de_de: <li>Tippe auf den Block <b>Aktion</b> <b>Fahrt</b>, um ihn zu bearbeiten.<li>Wähle<b> Augenleuchten an</b> aus der Liste der möglichen Aktionen aus.<li>Benutze weiterhin die Variable<b> Orange</b>.

source: Stack the <b>If Else</b> loop under <b>Do Eye Light On</b>. Make Dot do the <b>Weird Buzz</b> sound until all the <b>eye lights</b> come on. When all eye lights come on, Dot should <b>Say Hi</b>.
de_de: Ziehe die Schleife <b>Wenn/Sonst unter</b><b> Aktion Augenlicht an</b>. Lass Dot das Geräusch<b> Komisches Summen</b> machen, bis alle<b> Augenlichter</b> eingeschaltet sind. Wenn alle Augenlichter eingeschaltet sind, sollte Dot<b> Hallo</b> sagen.

source: <li>What number should we set the variable to in the <b>If variable</b> block? Hint: how many eye lights does Dot have?<li>Don't remove or change any of the other blocks inside the If Else block. <li>Make sure the <b>If Else</b> loop is stacked under the <b>Do Eye Light On</b> block.
de_de: <li>Welche Zahl sollen wir für den Block <b>Wenn Variable</b> auswählen? Tipp: Wie viele Augenlichter hat Dot?<li>Entferne oder ändere keinen der anderen Blöcke innerhalb des Blocks Wenn/Sonst. <li>Achte darauf, dass die Schleife <b>Wenn/Sonst</b> unter dem Block <b>Aktion Augenlicht an</b> gestapelt ist.

source: To finish the program, add a new <b>Eye Pattern</b> under <b>Say Hi</b>. Customize the new eye pattern to give Dot a <b>smile</b>.
de_de: Um das Programm abzuschließen, füge ein neues <b>Augenmuster</b> unter <b>Sag Hallo</b> hinzu. Verändere das neue Augenmuster so, dass du Dot ein <b>Lächeln</b> verleihst.

source: <li>Drag the new <b>Eye Pattern</b> block from the <b>Light</b> section of the menu on the left.<li>Make sure it's stacked directly under the <b>Say Hi</b> block.
de_de: <li>Ziehe den neuen Block <b>Augenmuster</b> aus dem Bereich <b>Licht</b> im Menü auf der linken Seite.<li>Achte darauf, dass er direkt unter dem Block <b>Sag Hallo</b> ist.

source: Random Color Ball
de_de: Farbkugel

source: Turn Dot into a ball that changes colors randomly with each toss.
de_de: Verwandle Dot in eine Kugel, die zufällig ihre Farben ändert, wenn sie in die Luft geworfen wird.

source: Totally random!
de_de: Das sind tolle Zukunftsaussichten!

source: What games can you come up with to play with your friends using the random color ball? Can you add random sounds to the program?
de_de: Hast du Ideen für Spiele, bei denen du die Farbkugel benutzen kannst? Kannst du dem Programm andere Sounds hinzufügen?

source: Connect the blocks so that Dot's light goes <b>black</b> when you tap <b>Start</b>.
de_de: Kombiniere die Blöcke so, dass Dots Lichter <b>schwarz</b> werden, wenn du <b>Start</b> antippst.

source: Edit <b>Set variable</b>. Choose the <b>random</b> (dice) icon. Then set it so that Dot <b>chooses a random number between 1 and 3</b>. Toss Dot and watch the orange variable change.
de_de: Bearbeite <b>Setze Variable</b>. Wähle das <b>Zufalls</b>-Symbol (Würfel) aus. Stelle es dann so ein, dass Dot <b>eine zufällige Zahl zwischen 1 und 3 auswählt. </b>Wirf Dot in die Luft, damit die Orangen-Variable sich ändert.

source: <li>When you edit the <b>Set variable</b> block, select the <b>dice icon</b> for random. <li>Tap the <b>+ (plus)</b> or <b>- (minus)</b> signs to change the numbers. Set a range from <b>1 to 3</b>.
de_de: <li>Wenn du den Block <b>Setze Variable</b> bearbeitest, wähle das <b>Würfel-Symbol</b> für den Zufallsgenerator. <li>Tippe das Symbol <b>+ (Plus)</b> oder <b>- (Minus)</b> an, um die Zahlen zu ändern. Lege ein Intervall zwischen <b>1 und 3 fest</b>.

source: Edit <b>If variable > 0</b>. Change it so that <b>if the variable = 1</b>, then Dot will turn red. Toss Dot. When the variable = 1, Dot should turn red.
de_de: Bearbeite den Block <b>Wenn Variable &gt; 0</b> so, dass, Dot rot aufleuchtet, <b>wenn die Variable = 1 ist. </b>Wirf Dot in die Luft. Wenn die Variable = 1 ist, sollte Dot rot werden.

source: <li>You don't need to add or remove any blocks. Just edit the <b>If variable</b> block. <lI>Change the > sign to an = sign.<li>Change the 0 to a 1</b>.
de_de: <li>Du brauchst keine Blöcke hinzuzufügen oder zu entfernen. Bearbeite nur einfach den Block <b>Wenn Variable</b>. <lI>Ändere das Zeichen &gt; zu dem Zeichen =.<li>Ändere die 0 zu einer 1</b>.

source: Connect the blocks so that <b>if the variable = 2</b>, Dot will turn <b>green</b>.
de_de: Verbinde die Blöcke so, dass Dot <b>grün</b><b> wird, wenn die Variable = 2 ist</b>.

source: <li>Stack the second <b>if variable</b> block under the first one. <li>Put the <b>green lights</b> inside the second <b>If variable</b> block.<li>Change the <b>if variable</b>block to <b>if variable = 2</b>.
de_de: <li>Ziehe den zweiten Block der Kategorie <b>Wenn Variable</b> unter den ersten. <li>Füge die <b>grünen Lichter</b> in den zweiten Block der Kategorie <b>Wenn Variable</b> ein.<li>Ändere den Block <b>Wenn Variable</b> zu <b>Wenn Variable = 2</b>.

source: Add new blocks from the menu to the program so that <b>if the variable = 3</b>, Dot turns <b>yellow</b>.
de_de: Füge dem Programm neue Blöcke aus dem Menü hinzu, sodass Dot gelb wird, <b>wenn die Variable = 3</b><b> ist</b>.

source: <li>Drag a new <b>if variable</b> block from the Variables section of the menu on the left. Stack it at the bottom of the program. <li>Edit it to <b>If variable = 3</b>. <li>Drag an <b>All lights</b> block from the <b>Light</b> section of the menu and put it inside the third <b>if variable</b> block.
de_de: <li>Ziehe einen neuen Block der Kategorie <b>Wenn Variable</b> aus dem Bereich „Variablen“ im Menü auf der linken Seite in die Mitte des Bildschirms. Füge es am Ende des Programms an. <li>Bearbeite es so, dass <b>Wenn Variable = 3</b> ist. <li>Ziehe einen Block der Kategorie <b>Alle Lichter</b> aus dem Bereich <b>Licht</b> im Menü und füge es in den dritten Block der Kategorie <b>Wenn Variable</b> ein.

source: Naughty or Nice Scanner
de_de: Böse oder brav?

source: Use Dot as a scanner to help Santa find out if your friends have been naughty or nice!
de_de: Benutze Dot als Scanner und hilf dem Weihnachtsmann, herauszufinden, ob deine Freunde böse oder brav waren!

source: Did you make the list?
de_de: Hast du deine Liste schon geschrieben?

source: Whether you've been naughty or nice, there's all sorts of fun you can have with a scanner. Can you add to the randomness with a third possible answer?
de_de: Ob du nun böse oder brav warst, es gibt unendlich viele tolle Sachen, die du mit einem Scanner unternehmen kannst. Kannst du noch eine Option hinzufügen, indem du eine dritte Antwort erfindest?

source: Let's add an <b>Animation</b> to the program. Find <b>Dance Dot Happy</b> in the <b>Animations</b> section of the menu. Stack it under <b>Start</b>.
de_de: Lass uns eine <b>Animation</b> hinzufügen. Finde <b>Tanzen Dot Glücklich</b> in dem Bereich <b>Animationen</b> im Menü. Füge den Block unter <b>Start</b> an.
