Repository: montecab/FriProj
Catalog: po-boy/blockly/2.8.2/blockly_challenges_*.po
Languages: de_de

source: Dash is competing in a dance competition, first solo and then with a dance partner.
de_de: Dash nimmt an einem Tanzwettbewerb teil! Zuerst tanzt er alleine, dann mit einem Tanzpartner.

source: Dash has the moves!
de_de: Dash weiß, wie man das Tanzbein schwingt!

source: Now you have a dancing robot! What other things can you have Dash <b>repeat until</b> being stopped by something else?
de_de: Fertig ist dein tanzender Roboter! Welche Aktionen kannst du Dash noch so lange <b>wiederholen lassen</b>, bis er durch etwas gestoppt wird?

source: Dash is having fun! Put the blocks together. Then edit the <b>Repeat until</b> block so that Dash turns red and says "Wee!" until detecting an <b>obstacle in front</b>.
de_de: Dash hat richtig viel Spaß! Verbinde die Blöcke miteinander. Bearbeite dann den Block <b>Wiederholen bis</b> so, dass Dash erst rot aufleuchtet und dann „Hui!“ sagt, bis er ein <b>Hindernis vor sich</b> entdeckt.

source: <li>Tap the <b>Repeat until</b> block to edit it. Can you find the option that will cause Dash to <b>repeat until</b> detecting an <b>obstacle in front</b>? <li>Try it out by putting your hand in front for Dash to detect.
de_de: <li>Tippe auf den Block <b>Wiederholen bis</b>, um ihn zu bearbeiten. Findest du die Option, mit der du Dash dazu bringst, eine Aktion so lange zu <b>wiederholen, bis</b> er ein <b>Hindernis vor</b> sich entdeckt? <li>Probiere es aus, indem du Dash deine Hand vor die Nase hältst. Mal sehen, ob er sie erkennt!

source: Add more blocks to make Dash move <b>backward</b>, look <b>left</b>, move <b>forward</b>, look <b>right</b>, and turn <b>green</b>. Use an obstacle to stop Dash when the light is green.
de_de: Füge weitere Blöcke hinzu, damit Dash <b>rückwärtsfährt</b>, nach <b>links</b> schaut, <b>vorwärtsfährt</b>, nach <b>rechts</b> schaut und dann <b>grün</b> aufleuchtet. Verwende ein Hindernis, um Dash zum Stoppen zu bringen, wenn er grün aufleuchtet.

source: <li>The entire dance routine should be inside the <b>Repeat until</b> block and between the red and green blocks. <li>Dash won't be looking for an obstacle when the light is red, so wait until the light is green to stop Dash.
de_de: <li>Die gesamte Tanzabfolge sollte sich im Block <b>Wiederholen bis</b> und zwischen den roten und den grünen Blöcken befinden. <li>Dash achtet nicht auf Hindernisse, wenn das Licht rot leuchtet, warte also, bis das Licht grün aufleuchtet, um Dash zu stoppen.

source: When Dash meets the dance partner (the obstacle), Dash should <b>sigh</b> with happiness. The sigh should <b>not</b> be part of the repeating actions.
de_de: Wenn Dash auf seinen Tanzpartner trifft (also das Hindernis erkennt), sollte er vor Freude einen <b>Seufzer</b> ausstoßen. Der Seufzer sollte aber <b>nicht</b> zu den sich wiederholenden Aktionen gehören.

source: <li>The <b>sigh</b> should go below the <b>Repeat until</b> block, not inside it. <li>Remember to interrupt Dash with an obstacle when the light is green, not red.
de_de: <li>Ziehe den <b>Seufzer</b> daher unter und nicht in den Block <b>Wiederholen bis</b>. <li>Denk dran, Dash mit einem Hindernis zu unterbrechen, wenn er grün aufleuchtet und nicht rot.

source: We've added moves for the slow dance. Make the slow dance <b>repeat until</b> Dash detects the clap. Then <b>connect the stacks</b> and make Dash say "Ta Da!"
de_de: Wir haben ein paar Schritte für den langsamen Tanz hinzugefügt. Lass Dash den langsamen Tanz so lange <b>wiederholen, bis</b> er ein Klatschgeräusch hört. Danach musst du die <b>Stapel verbinden</b> und Dash „Tada!“ sagen lassen.

source: <li>Put the slow dance blocks into a new <b>Repeat until</b> block. <li>Connect the stacks.<li>Try clapping when Dash's light is green, not red.
de_de: <li>Ziehe die Blöcke für den langsamen Tanz in einen neuen Block der Kategorie <b>Wiederholen bis</b>. <li>Verbinde die Stapel miteinander.<li> Probiere aus, was passiert, sobald du klatschst, wenn Dash grün und nicht rot aufleuchtet.

source: Ice Skating
de_de: Eiskunstlauf

source: Dash is nervous but is very determined to master the ice. Dash will start out slow, but by the end Dash will skate like a pro!
de_de: Dash ist ein bisschen aufgeregt, aber er will unbedingt auf dem Eis eine gute Figur machen. Dash startet vorsichtig, aber am Ende bewegt er sich auf dem Eis wie ein Profi!

source: Ice skating with style!
de_de: Eine glanzvolle Show auf dem Eis!

source: Now you have an ice-skating robot! Try changing the <b>wheel speeds</b> to see what happens as your robot glides across the ice!
de_de: Dein Roboter ist ein echter Star auf dem Eis! Versuche nun, die <b>Radgeschwindigkeiten</b> zu ändern, um zu sehen, was passiert, wenn dein Roboter übers Eis gleitet!

source: Turn Dash’s lights <b>red</b>. Then make the wheels go <b>forward</b> very slowly. Create the eye pattern in the picture. Tap <b>Start</b> and see Dash skate slowly.
de_de: Lass Dash <b>rot</b> aufleuchten. Stell die Radgeschwindigkeit so ein, dass dein Roboter sehr langsam <b>vorwärtsfährt</b>. Erstelle das Augenmuster, das auf dem Bild angezeigt wird. Tippe auf <b>Start</b>, um Dash langsam auf dem Eis laufen zu lassen.

source: Dash's wheels should both go <b>forward very slowly</b>.
de_de: Beide Räder von Dash sollten sich <b>sehr langsam vorwärtsdrehen</b>.

source: Dash is getting confident! <b>Add a new block</b> to the bottom of the stack to make Dash go a little faster. Then turn Dash’s lights orange.
de_de: Dash wird nun mutiger! <b>Zieh einen neuen Block</b> unter den Stapel, um Dash ein bisschen schneller auf dem Eis tanzen zu lassen. Lass Dash dann orange aufleuchten.

source: Both of Dash’s wheels should still be moving <b>forward slow</b>.
de_de: Beide Räder von Dash sollten sich weiterhin <b>langsam vorwärtsdrehen</b>.

source: Dash is getting the hang of it! <b>Add to the program</b> to make Dash go <b>forward</b> at a <b>normal</b> speed. Then give Dash a new <b>eye pattern</b>.
de_de: Dash hat so langsam den Dreh raus! <b>Erweitere das Programm</b>, um Dash in <b>normaler</b> Geschwindigkeit <b>vorwärtsfahren</b> zu lassen. Verpasse Dash dann ein neues <b>Augenmuster</b>.

source: Dash should start off slow each time you press Start and then pick up speed.
de_de: Dash sollte jedes Mal, wenn du Start drückst, erst langsam beginnen und dann schneller werden.

source: Now it’s time to see what Dash can really do. <b>Add to the program</b> to make Dash's wheels move <b>fast</b>. Then turn Dash’s lights <b>yellow</b>.
de_de: Jetzt ist es Zeit, zu sehen, was Dash wirklich tun können! <b>Erweitere das Programm</b>, damit sich die Räder von Dash <b>schnell</b> drehen. Lass Dash dann <b>gelb</b> aufleuchten.

source: Dash is going to need a lot of room for these ice skating moves!
de_de: Für diesen Tanz auf dem Eis braucht Dash viel Platz!

source: Now <b>add</b> a spin: <b>left</b> wheel <b>fast</b>, <b>right</b> wheel <b>normal</b>. Then add a reverse spin: <b>left</b> wheel <b>normal</b>, <b>right</b> wheel <b>fast</b>. Make Dash smile with an eye pattern.
de_de: Nun kannst du eine Drehung <b>hinzufügen</b>: Lass das <b>linke</b> Rad <b>schnell</b> und das <b>rechte</b> Rad in <b>normaler</b> Geschwindigkeit drehen. Mach dann eine Drehung rückwärts: Lass das <b>linke</b> Rad in <b>normaler</b> Geschwindigkeit und das <b>rechte</b> Rad <b>schnell</b> drehen. Zaubere Dash dann mit dem Augenmuster ein Lächeln ins Gesicht.

source: To do an ice-skating spin, add <b>Set Wheel Speed</b> blocks to make Dash's wheels move <b>forward</b> at different speeds. You don't need to use reverse.
de_de: Um eine Drehung auf dem Eis hinzuzufügen, brauchst du Blöcke der Kategorie <b>Radgeschwindigkeit Einstellen</b>, damit sich die Räder von Dash in unterschiedlichen Geschwindigkeiten <b>vorwärts</b> drehen. Du musst Dash nicht rückwärtsfahren lassen.

source: Dash is full of confidence and wants to skate at top speed! <b>Add a block</b> to make Dash go forward <b>really fast</b>. Then make Dash’s lights turn <b>green</b>.
de_de: Dash möchte jetzt alles geben und in Blitzgeschwindigkeit auf dem Eis tanzen! <b>Füge einen Block hinzu, um Dash </b><b>sehr schnell</b> vorwärtsfahren zu lassen. Lass Dash dann <b>grün</b> aufleuchten.

source: Both of Dash’s wheels should move <b>forward really fast</b>.
de_de: Beide Räder von Dash sollten sich <b>sehr schnell vorwärtsdrehen</b>.

source: Make Dash’s wheels go <b>forward</b> at very different speeds. Then add another block that does a reverse version of the move. Give Dash a new happy face.
de_de: Lass die Räder von Dash in unterschiedlichen Geschwindigkeiten <b>vorwärtsdrehen</b>. Füge dann einen weiteren Block hinzu, mit dem du die gleiche Bewegung nochmal umgekehrt ausführst. Lass Dash dann ein glückliches Gesicht aufsetzen.

source: <li>Add 2 new <b>Set Wheel Speed</b> blocks. <li>In the first one, make the left wheel go <b>forward really fast</b> and the right wheel <b>forward very slow</b>. <li>In the second one, make the <b>left</b> wheel go <b>forward very slow</b> and the right wheel <b>forward really fast</b>.
de_de: <li>Füge 2 neue Blöcke der Kategorie <b>Radgeschwindigkeit Einstellen</b> hinzu. <li>Lass das linke Rad beim ersten Block <b>sehr schnell vorwärtsdrehen</b> und das rechte <b>sehr langsam vorwärtsdrehen</b>. <li>Beim zweiten Block lässt du das <b>linke</b> Rad <b>sehr langsam vorwärtsdrehen</b> und das rechte Rad <b>sehr schnell vorwärtsdrehen</b>.

source: Now for the big move! Make Dash spin in a circle by making the wheels go <b>forward</b> at different speeds. End with a big smile and blue lights.
de_de: Nun zeigt Dash dir eine unglaubliche Figur! Lass Dash sich im Kreis drehen, indem du einstellst, dass sich die Räder in unterschiedlichen Geschwindigkeiten <b>vorwärtsdrehen</b>. Beende die Figur mit einem breiten Lächeln und blauen Lichtern.

source: Make Dash spin in a circle by making the wheels move forward at very different speeds. For example, one wheel might move <b>forward really fast</b> and the other wheel <b>forward very slow</b>.
de_de: Lass Dash eine Drehung ausführen, indem sich die Räder in unterschiedlichen Geschwindigkeiten vorwärtsdrehen. Zum Beispiel kann ein Rad sich <b>sehr schnell</b> und das andere Rad sich <b>sehr langsam vorwärtsdrehen</b>.

source: Add a <b>Wheel Speed</b> block like the last one but with wheel speeds switched. Make the lights purple, then <b>stop</b> Dash’s <b>wheels</b>. Record a happy <b>sound</b> for the end.
de_de: Füge wie beim letzten Mal einen Block der Kategorie <b>Radgeschwindigkeit Einstellen</b> hinzu, aber tausche die Radgeschwindigkeiten aus. Lass Dash lila aufleuchten und dann die <b>Räder </b><b>stoppen</b>. Nimm einen fröhlichen <b>Sound</b> für das Ende auf.

source: Dash’s wheels should be moving <b>forward</b> at very different speeds. If one wheel is moving <b>forward really fast</b>, the other wheel should move <b>forward very slow</b>.
de_de: Die Räder von Dash sollten sich in sehr unterschiedlichen Geschwindigkeiten <b>vorwärtsbewegen</b>. Wenn sich ein Rad <b>sehr schnell vorwärtsbewegt</b>, sollte sich das andere Rad <b>sehr langsam vorwärtsbewegen</b>.

source: Nosy Robot
de_de: Neugieriger Roboter

source: Turn Dash into a nosy robot who always wants to know what's going on.
de_de: Verwandele Dash in einen neugierigen Roboter, der seine Nase in alle Angelegenheiten steckt.

source: Yay! An annoying robot!
de_de: Juhu! Ein nerviger, neugieriger Roboter!

source: Now you've got a pesky little robot who always wants to know what's going on. Can you use <b>random variables</b> to give your robot some other nosy things to say?
de_de: Jetzt hast du einen nervigen kleinen Roboter, der seine Nase in alle Angelegenheiten steckt. Kannst du <b>zufällige Variablen</b> verwenden, damit dein Roboter noch ein paar andere nervige Dinge sagt?

source: <b>Connect the blocks</b> so that after seeing an <b>Obstacle in Front</b>, Dash will <b>wink</b> and then make a <b>custom sound</b>. Record your own voice and make Dash say something nosy.</b>
de_de: <b>Verbinde die Blöcke so miteinander</b>, dass Dash, nachdem er ein <b>Hindernis Vorne</b> gesehen hat, <b>zwinkert</b> und dann einen <b>Eigenen Sound</b> abspielt. Nimm deine eigene Stimme auf und lass Dash etwas Nerviges sagen.</b>

source: <li>The 3 <b>Eye Pattern</b> blocks create a wink animation when they are together.<li>Put the <b>Eye Pattern</b> blocks directly under the <b>When Dash Obstacle in Front</b> block.<li>Then add the <b>My sounds #1</b> block under the Eye Pattern blocks.
de_de: <li>Die 3 Blöcke für die <b>Augenmuster</b> bilden eine Zwinkeranimation, wenn sie zusammen verwendet werden. <li>Ziehe die Blöcke für die <b>Augenmuster</b> direkt unter den Block <b>Wenn Dash Hindernis Vorne</b>. <li>Ziehe dann den Block <b>Meine Sounds #1</b> unter die Blöcke für die Augenmuster.

source: Turn the wink and nosy line into a <b>function</b>. Drag the <b>Eye Pattern</b> and <b>My sounds</b> blocks into the <b>Function Nosy</b> loop. Put <b>Call Nosy</b> under <b>When Dash Obstacle In Front</b>.
de_de: Verbinde das Zwinkern und den nervigen Text zu einer <b>Funktion</b>. Zieh die Blöcke für das <b>Augenmuster</b> und <b>Meine Sounds</b> in die Schleife <b>Funktion Neugierig</b>. Zieh die Funktion <b>Abruf Neugierig</b> unter den Block <b>Wenn Dash Hindernis Vorne</b>.

source: We want Dash to perform the same <b>Nosy Function</b> after Dash <b>looks towards voice</b>. Drag a new <b>Call Nosy</b> block from the menu and add it under <b>Look towards voice</b>.
de_de: Nun soll Dash die gleiche <b>Neugierige Funktion</b> ausführen, nachdem er sich in die <b>Richtung gedreht hat, aus der die Stimme kommt</b>. Ziehe einen neuen Block der Kategorie <b>Abruf Neugierig</b> aus dem Menü in das Programmfeld unter <b>In Richtung der Stimme drehen</b>.

source: <li>Notice the <b>Call Nosy</b> block under <b>When Dash Obstacle In Front</b> block. A Function block allows you to use a piece of code in multiple places without having to build the whole thing each time.<li>When you finish this step, there should be a <b>Call Nosy</b> block at the bottom of each of the 2 green <b>When</b> stacks.
de_de: <li>Achte auf den Block <b>Abruf Neugierig</b> unter dem Block <b>Wenn Dash Hindernis Vorne</b>. Bei einem Funktions-Block kannst du eine Code-Abfolge an mehreren Stellen verwenden, ohne dass du die Aktion immer wieder neu programmieren musst. <li>Wenn du damit fertig bist, dann siehst du einen Block <b>Abruf Neugierig</b> unter jedem grünen Stapel der Kategorie <b>Wenn</b>.

source: We've added a new <b>When</b> stack for when Dash detects an <b>Obstacle Behind</b>. Call the <b>Nosy function</b> at the bottom of this new stack.
de_de: Wir haben einen neuen Stapel der Kategorie <b>Wenn</b> hinzugefügt, für den Fall, dass Dash ein <b>Hindernis Hinten</b> erkennt. Zieh die <b>Neugierig-Funktion</b> unter diesen neuen Stapel, um sie hier abzurufen.

source: <li>Add a new <b>Call Nosy</b> block under <b>Turn Left 180</b>.
de_de: <li>Zieh einen neuen Block der Kategorie <b>Abruf Neugierig</b> unter den Block <b>Nach Links Drehen 180</b>.

source: Tap the <b>Function Nosy</b> block and choose another name for it. You can call it anything you want. Notice that the <b>Call</b> blocks change the name automatically to match.
de_de: Tippe auf den Block <b>Funktion Neugierig</b> und wähle einen anderen Namen dafür aus. Du kannst dir aussuchen, wie die Funktion heißen soll. Du solltest wissen, dass die Namen der Blöcke der Kategorie <b>Abruf</b> automatisch angepasst werden.

source: The Terrible Troll of Trepidation
de_de: Wer hat Angst vom bösen Troll?

source: <b>You shall not pass!</b> Dash has transformed into the Terrible Troll of Trepidation. To continue, you need to defeat this monster.
de_de: <b>Hier kommst du nicht durch!</b> Dash hat sich in einen angsteinflößenden, bösen Troll verwandelt. Du musst zuerst dieses Monster besiegen, damit du weiterspielen kannst.

source: You have defeated the Troll!
de_de: Du hast den Troll besiegt!

source: Hurray! You win! What could you add to the program to make the Troll come back to life after the 4th clap?
de_de: Hurra! Du hast gewonnen! Was könntest du noch zum Programm hinzufügen, damit der Troll nach dem 4. Klatschgeräusch wieder zum Leben erweckt wird?

source: Use variables to get past the Troll! A <b>variable</b> is like a bag that holds a <b>number</b> you put into it. Press <b>Start</b> and see the <b>orange</b> variable on the top left side.
de_de: Um am Troll vorbeizukommen, musst du Variablen verwenden. Eine <b>Variable</b> ist wie ein Beutel, in den du eine <b>Zahl</b> legst. Drücke auf <b>Start</b> und du siehst die Variable <b>Orange</b> oben links.

source: After you tap <b>Start</b>, the orange variable should appear on the top left side of your screen.
de_de: Nachdem du auf <b>Start</b> getippt hast, sollte die Orangen-Variable oben links auf deinem Bildschirm angezeigt werden.

source: Variables can help the Troll remember how many times you clap. Edit the <b>Change by</b> block so that each time you clap, the orange variable goes <b>up by 1</b>.
de_de: Variablen helfen dem Troll auf die Sprünge, damit er sich erinnern kann, wie oft du klatschst. Bearbeite den Block <b>Ändern um</b>, damit die Orangen-Variable mit jedem Klatschen <b>um 1 nach oben geht</b>.

source: Tap the <b>Change by</b> block to edit it. How can you make sure the number goes <b>up by 1</b> each time Dash hears a clap?
de_de: Tippe auf den Block <b>Ändern um</b>, um ihn zu bearbeiten. Wie schaffst du es, dass die Zahl immer <b>um 1 nach oben geht</b>, wenn Dash ein Klatschgeräusch hört?

source: We've added an <b>Eye Pattern</b> block. Dash has 12 eye lights, which are the Troll's 12 hit points. Tap <b>My sounds</b> and record your voice saying, "You shall not pass!"
de_de: Wir haben einen Block für <b>Augenmuster</b> hinzugefügt. Dash hat 12 Lichter am Auge und genau so viele Leben hat der Troll. Tippe auf <b>Meine Sounds</b> und nimm mit deiner Stimme „Du darfst hier nicht vorbei!“ auf.

source: Remember which <b>My sounds</b> slot you use. You should use a different slot for each sound you record.
de_de: Du musst dir merken, welchen Sound-Slot du für <b>deinen Sound</b> verwendet hast. Du solltest für jeden aufgenommenen Sound einen anderen Sound-Slot verwenden.

source: When you clap, the Troll loses 4 hit points (4 eye lights). Then make Dash say something like, "Ouch!" The 4 eye lights you turn off must be next to each other!
de_de: Jedes Mal, wenn du klatschst, verliert der Troll gleich 4 Leben (4 Lichter am Auge). Lass Dash dann so etwas sagen wie „Autsch!“. Die 4 Augenlichter, die du ausschaltest, müssen nebeneinander liegen!

source: <li>The program won't work unless the 4 eye lights you turn off are next to each other.<li>Don't start clapping until after the Troll stops speaking.
de_de: <li>Das Programm funktioniert nur, wenn die 4 Augenlichter, die du ausschaltest, nebeneinander liegen. <li>Du darfst erst klatschen, wenn der Troll aufgehört zu sprechen.

source: The Troll reacts every time you clap, because those numbers are all <b>greater than 0</b>. Edit the <b>If</b> block so that the Troll only reacts <b>the first time you clap</b>.
de_de: Der Troll reagiert jedes Mal, wenn du klatschst, denn diese Zahlen sind alle <b>größer als 0</b>. Bearbeite den Block <b>Wenn</b>, damit der Troll nur reagiert, wenn du <b>zum ersten Mal klatschst</b>.

source: Tap the <b>If</b> block to edit it. You can use <b>less than</b>, <b>equals</b>, or <b>greater than</b>. Which one should you use to make the Troll react <b>only the first</b> time you clap?
de_de: Tippe auf den Block <b>Wenn</b>, um ihn zu bearbeiten. Du kannst <b>weniger als</b>, <b>gleich</b> oder <b>größer als</b> verwenden. Welche Option brauchst du, damit der Troll <b>nur beim ersten</b> Klatschen reagiert?

source: The Troll needs a reaction for the 2nd clap. Follow the pattern and add a new <b>sound</b>. Make the Troll say something like "You got me!" or "It's just a flesh wound!"
de_de: Der Troll braucht eine Reaktion für das 2. Klatschen. Gehe nach dem gleichen Muster vor und füge einen neuen <b>Sound</b> hinzu. Lass den Troll so etwas sagen wie „Getroffen!“ oder „Das ist nur eine Wunde, die heilt wieder!“.

source: <li>Follow the pattern and add another <b>If variable</b> block. <li>Edit the block so that the Troll reacts only <b>if the variable = 2</b>.<li>Be sure to use a different sound slot from the other 2 sounds.
de_de: <li>Gehe nach dem gleichen Muster vor und füge einen weiteren Block der Kategorie <b>Wenn Variable</b> hinzu. <li>Bearbeite den Block, damit der Troll nur reagiert, <b>wenn die Variable = 2</b> ist. <li>Achte darauf, dass du einen anderen Sound-Slot als bei den letzten beiden Sounds verwendest.

source: The second time you clap, the Troll's hit points go down to <b>4</b>. The Troll is getting weaker! What should you add to the program to make that happen?
de_de: Nach dem zweiten Klatschen bleiben dem Troll nur noch <b>4</b> Leben. Er wird immer schwächer! Was musst du programmieren, damit das passiert?

source: <li>The new <b>Eye Pattern</b> should be part of the reaction that happens <b>If</b> the <b>variable = 2</b>. <li>The 8 eye lights you <b>turn off</b> should all be together, not spread apart.
de_de: <li>Das neue <b>Augenmuster</b> sollte Teil der Reaktion sein, die ausgelöst wird, <b>wenn</b> die <b>Variable = 2</b> ist. <li>Die 8 Augenlichter, die du <b>ausschaltest</b>, müssen alle nebeneinander liegen.

source: Only 1 more clap to defeat the Troll! Add a new <b>sound</b> and <b>eye pattern</b> that will happen <b>if</b> the <b>variable = 3</b>. The eye lights should all be off after the 3rd clap!
de_de: Nur noch 1 Mal klatschen und du hast den Troll besiegt! Füge einen neuen <b>Sound</b> und ein <b>Augenmuster</b> hinzu, die ausgeführt werden, <b>wenn</b> die <b>Variable = 3</b> ist. Die Augenlichter sollten nach dem 3. Klatschen alle ausgeschaltet sein.

source: Follow the pattern and add a new <b>If</b> block. It will work <b>if variable = 3</b> or <b>if variable > 2</b>.
de_de: Gehe nach dem gleichen Muster vor und füge einen neuen Block der Kategorie <b>Wenn</b> hinzu. Du kannst entweder <b>Wenn Variable = 3</b> oder <b>Wenn Variable &gt; 2</b> verwenden.

source: You defeated the Troll! Add something to the third <b>If</b> block to make it look like Dash's lights are off. What color makes it look like Dash's lights are out?
de_de: Du hast den Troll besiegt! Füge zu dem dritten Block der Kategorie <b>Wenn</b> eine Aktion hinzu, damit es so aussieht, als wären alle Lichter von Dash ausgeschaltet. Bei welcher Farbe sieht es so aus, als wären die Lichter von Dash aus?

source: The <b>All Lights Black</b> block should go directly under the last <b>My sounds</b> block.
de_de: Du musst den Block <b>Alle Lichter Schwarz</b> direkt unter den letzten Block der Kategorie <b>Meine Sounds</b> ziehen.

source: Ticking Time Bomb
de_de: Tickende Zeitbombe

source: In this puzzle, you are going to create your very own Dash time bomb. Dash will count down from 12 to 0 using eye lights and then go crazy!!
de_de: In diesem Puzzle erstellst du deine eigene Dash-Zeitbombe! Dash zählt mit den Lichtern an seinem Auge von 12 auf 0 herunter und dreht dann völlig durch!

source: Explosive success!
de_de: Bombenstark!

source: Play around with your time bomb, and maybe you can use it in a game. What other special effects do you want to add to your time bomb?
de_de: Spiele ein bisschen mit deiner Zeitbombe herum. Vielleicht kannst du sie ja in einem anderen Spiel gut gebrauchen? Welche Spezialeffekte möchtest du noch zu deiner Zeitbombe hinzufügen?
