Repository: montecab/FriProj
Catalog: po-boy/chrome_ios/1.0.0/chrome_ios_*.po
Languages: de_de

source: Searching for robots
de_de: Suche nach Robotern läuft

source: Select a robot
de_de: Wähle einen Roboter aus

source: Connecting
de_de: Verbindung wird hergestellt

source: Connected!
de_de: Verbunden!

source: Tap again to disconnect
de_de: Tippe noch einmal, um die Verbindung zu trennen

source: Disconnecting
de_de: Verbindung wird getrennt

source: Disconnected!
de_de: Verbindung getrennt!

source: No robots found
de_de: Keine Roboter gefunden

source: I was unable to complete the update. Please plug me in and try again.
de_de: Ich konnte die Aktualisierung nicht abschließen. Schließe mich bitte an und versuche es dann nochmal.

source: Try again
de_de: Nochmal versuchen

source: This app works with Dash and Dot from Wonder Workshop only. Please make sure your robot is powered on and search again.
de_de: Diese App funktioniert nur mit den beiden Robotern Dash und Dot von Wonder Workshop. Bitte schau noch einmal genau nach, ob dein Roboter auch eingeschaltet ist, und starte dann die Suche erneut.

source: Search again
de_de: Erneut suchen

source: refresh
de_de: Aktualisieren

source: Step 1 of 3
de_de: Schritt 1 von 3

source: Oops, your Bluetooth is off!
de_de: Ups, dein Bluetooth ist aus!

source: Please turn on Bluetooth and search again for robots.
de_de: Schalte bitte dein Bluetooth ein und suche dann erneut nach Robotern.

source: Ok
de_de: Okay

source: All done!
de_de: Fertig!

source: Yay! I finished the update. Press the arrow to continue.
de_de: Hurra! Ich habe die Aktualisierung abgeschlossen. Drücke auf den Pfeil, um fortzufahren.

source: Updating...
de_de: Wird aktualisiert ...

source: Update your robot
de_de: Aktualisiere deinen Roboter

source: I need an update
de_de: Ich brauche ein Update

source: Big things are coming your way! Plug me in, this may take up to %d minutes.
de_de: Es warten ein paar tolle Sachen auf dich! Schließe mich an, es könnte bis zu %d Minuten dauern.

source: Update Complete!
de_de: Update abgeschlossen!

source: Update failed
de_de: Aktualisierung fehlgeschlagen

source: Updating your robot...
de_de: Dein Roboter wird aktualisiert ...

source: Update
de_de: Aktualisierung

source: Later
de_de: Später

source: Back
de_de: Zurück

source: Step 2 of 3
de_de: Schritt 2 von 3

source: Personalize your robot
de_de: Gestalte deinen Roboter

source: Connect to
de_de: Verbindung herstellen mit

source: %@ power is low!
de_de: Der Akku von %@ ist bald leer!

source: 10%% of battery remaining. Please charge soon.
de_de: Verbleibender Akku: 10 %. Bitte bald aufladen.

source: Select a Slot
de_de: Wähle einen Sound-Slot aus

source: Get Ready!
de_de: Mach dich bereit!

source: Recording...
de_de: Aufnahme gestartet ...

source: Transferring...
de_de: Übertragung läuft...

source: Save sound?
de_de: Sound speichern?

source: Back To App
de_de: Zurück zur App

source: Please enable microphone in settings!
de_de: Aktiviere bitte das Mikrofon in den Einstellungen!
