Repository: montecab/FriProj
Catalog: po-boy/blockly/2.9.2/blockly_source_*.po
Languages: de_de

source: Choose a random number between
de_de: Wähle eine zufällige Zahl zwischen

source: Project Image
de_de: Projektbild

source: Blank Project
de_de: Leeres Projekt

source: Dash Moves
de_de: Dash-Bewegungen

source: Loopy Shapes
de_de: Schleifenformen

source: Dashing Around
de_de: Herumdüsen

source: Tag you're it
de_de: Du bist

source: Dance With Dash
de_de: Tanz mit Dash

source: Dot Light Moves
de_de: Dot-Licht-Bewegungen

source: Cookie Jar Trap
de_de: Keksdose

source: Fight the Fire
de_de: Im Kampf gegen die Flammen

source: Simon Says
de_de: Simon sagt

source: Hide and Seek
de_de: Verstecken

source: Weird Robot
de_de: Komischer Roboter

source: Dash The Snake
de_de: Dash als Schlange

source: Hot Potato
de_de: Heiße Kartoffel

source: Create New Project
de_de: Neues Projekt erstellen

source: Name your Project
de_de: Gib deinem Projekt einen Namen

source: Create
de_de: Erstellen

source: Blockly has been updated!
de_de: Blockly wurde aktualisiert!

source: Start the first puzzle
de_de: Beginne das erste Puzzle

source: Wait for{0}{1}
de_de: Warten auf{0}{1}

source: Repeat forever
de_de: Endlos wiederholen

source: Repeat while
de_de: Wiederholen während

source: Repeat until
de_de: Wiederholen bis

source: If
de_de: Wenn

source: Else
de_de: Sonst

source: Repeat{0}times
de_de: Wiederhole{0}Mal

source: Wait for{0}seconds
de_de: Warte während{0}Sekunden

source: You have no functions to call. Add a new function first!
de_de: Du hast keine Funktionen, die du ausführen könntest. Füge zuerst eine neue Funktion hinzu!

source: Say
de_de: Sag

source: Animal
de_de: Tier

source: Weird
de_de: Komisch

source: My sounds
de_de: Meine Sounds

source: ( Random )
de_de: ( Zufällig )

source: Blank Project12131234
de_de: Leeres Projekt12131234

source: Blank Project12312312321
de_de: Leeres Projekt12312312321

source: Blank 3q242345 Project
de_de: Leeres 3q242345 Projekt

source: Function
de_de: Funktion

source: Call
de_de: Abruf

source: My First Program
de_de: Mein erstes Programm

source: Add Block Here
de_de: Block hier hinzufügen

source: All off
de_de: Alle aus

source: All on
de_de: Alle an

source: Custom
de_de: Eigene

source: Look Up/Down Angle
de_de: Winkel beim Hoch-/Runterschauen

source: The up/down angle of Dash's head from -7 to 22 degrees. Positive means up, negative means down.
de_de: Der Winkel von Dashs Kopf beim Hoch-/Runterschauen von -7 bis 22 Grad. Positiv bedeutet hoch, negativ bedeutet runter.

source: Look Left/Right Angle
de_de: Winkel beim Schauen nach links/rechts

source: The left/right angle of Dash's head from -135 to 135 degress. Positive means right, negative means left.
de_de: Der Winkel von Dashs Kopf, wenn er nach links oder rechts schaut, von -135 bis 135 Grad. Positiv bedeutet rechts, negativ bedeutet links.

source: Voice Direction
de_de: Sprechrichtung

source: The angle of your voice from Dash from -180 to 180 degrees. If you are in front of Dash, the value is 0. Positive means right, negative means left.
de_de: Der Winkel deiner Stimme gegenüber Dash von -180 bis 180 Grad. Wenn du direkt vor Dash stehst, ist der Wert 0. Positiv bedeutet rechts, negativ bedeutet links.

source: Obstacle From Left Sensor
de_de: Hindernis linker Sensor

source: How far something is from Dash's front left sensor. Values can be 0 (nothing), 1 (near), or 2 (far).
de_de: Wie weit etwas von Dashs vorderem linken Sensor entfernt ist. Werte können 0 (davor), 1 (nahe) oder 2 (weit) sein.

source: Obstacle From Right Sensor
de_de: Hindernis rechter Sensor

source: How far something is from Dash's front right sensor. Values can be 0 (nothing), 1 (near), or 2 (far).
de_de: Wie weit etwas von Dashs vorderem rechten Sensor entfernt ist. Werte können 0 (davor), 1 (nahe) oder 2 (weit) sein.

source: Obstacle From Back Sensor
de_de: Hindernis hinterer Sensor

source: How far something is from Dash's back sensor. Values can be 0 (nothing), 1 (near), or 2 (far).
de_de: Wie weit etwas von Dashs hinterem Sensor entfernt ist. Werte können 0 (davor), 1 (nahe) oder 2 (weit) sein.

source: Project Name
de_de: Projektname

source: New Puzzle
de_de: Neues Puzzle

source: A new puzzle is now available! Try it out
de_de: Ein neues Puzzle ist jetzt verfügbar! Probier es aus

source: Set{0}={1}
de_de: Setze{0}={1}

source: Change{0}by{1}{2}
de_de: Ändere{0}um{1}{2}

source: Helpful hint!
de_de: Hilfreicher Tipp!

source: Drive
de_de: Fahren

source: Make Dash drive by distance in cm. Positive means forward, negative means backward.
de_de: Leg fest, wie weit Dash in cm fahren soll. Positiv bedeutet vorwärts, negativ bedeutet rückwärts.

source: Turn
de_de: Drehen

source: degrees
de_de: Grad

source: Make Dash turn in place by degrees. Positive means right, negative means left.
de_de: Lass Dash sich gradweise auf der Stelle drehen. Positiv bedeutet rechts, negativ bedeutet links.

source: Wheel Speed L/R
de_de: Radgeschwindigkeit L/R

source: Set the speed of Dash's left and right wheel. The maximum is 100 cm/s. Positive means forward, negative means backward.
de_de: Stelle die Geschwindigkeit von Dashs linkem und rechtem Rad ein. Das Maximum liegt bei 100 cm/s. Positiv bedeutet vorwärts, negativ bedeutet rückwärts.

source: Look Up/Down
de_de: Hoch-/runterschauen

source: Make Dash look up or down by degrees. Positive means up, negative means down.
de_de: Lass Dash gradweise hoch- und runterschauen. Positiv bedeutet nach oben, negativ bedeutet nach unten.

source: Look Left/Right
de_de: Nach links/rechts schauen

source: Make Dash look left or right by degrees. Positive means right, negative means left.
de_de: Lass Dash gradweise nach links oder rechts schauen. Positiv bedeutet rechts, negativ bedeutet links.

source: Eye Light On
de_de: Augenleuchten an

source: Turn on Dash & Dot's eye light. Values can be from 1 to 12 counting clockwise.
de_de: Schalte Dashs und Dots Augenleuchten an. Werte können im Uhrzeigersinn zwischen 1 und 12 liegen.

source: Eye Light Off
de_de: Augenleuchten aus

source: Turn off Dash & Dot's eye light. Values can be from 1 to 12 counting clockwise.
de_de: Schalte Dashs und Dots Augenleuchten aus. Werte können im Uhrzeigersinn zwischen 1 und 12 liegen.

source: Do you want to play with <b>Dash</b> or <b>Dot</b>?
de_de: Möchtest du mit <b>Dash</b> oder <b>Dot</b> spielen?

source: Loading...
de_de: Laden …

source: random
de_de: zufällig

source: Press START to begin listening for events!
de_de: Drücke auf START und warte auf Ereignisse!

source: You have more puzzles to solve!
de_de: Es gibt noch mehr Puzzles!

source: Left
de_de: Links

source: Right
de_de: Rechts

source: On
de_de: An

source: Off
de_de: Aus

source: clear
de_de: leeren

source: Name your function
de_de: Gib deiner Funktion einen Namen

source: Good job!
de_de: Gute Arbeit!

source: All Lights
de_de: Alle Lichter

source: Left Ear
de_de: Linkes Ohr

source: Right Ear
de_de: Rechtes Ohr

source: Front
de_de: Vorne

source: Tail
de_de: Hinten

source: on
de_de: an

source: off
de_de: aus

source: Eye Pattern
de_de: Augenmuster

source: Race{0}{1}
de_de: Rennen{0}{1}

source: Answer{0}{1}
de_de: Antworten{0}{1}

source: Play{0}{1}
de_de: Spielen{0}{1}

source: Dance{0}{1}
de_de: Tanzen{0}{1}

source: Expression{0}{1}
de_de: Ausdruck{0}{1}

source: Greet{0}{1}
de_de: Grüßen{0}{1}

source: My Projects
de_de: Meine Projekte

source: Create New
de_de: Neu erstellen

source: Privacy policy
de_de: Datenschutzrichtlinie

source: Look
de_de: Schauen

source: Light
de_de: Licht

source: Animations
de_de: Animationen

source: Control
de_de: Steuerung

source: Variables
de_de: Variablen

source: Accessory
de_de: Zubehör

source: The Offical Certificate of{}MASTERY{}of beginner programming concepts{}including loops, conditionals and variables. Way to go! Share the news with your parents!
de_de: Die offizielle Bescheinigung über{}EXPERTENKENNTNISSE{}von Programmierungs-Konzepten für Anfänger,{}einschließlich Schleifen, bedingten Anweisungen und Variablen. Herzlichen Glückwunsch! Teile die guten Neuigkeiten mit deinen Eltern!

source: is hereby granted to
de_de: wird hiermit verliehen an

source: Adventurer
de_de: Abenteurer

source: Inventor
de_de: Erfinder

source: {0} of {1} completed
de_de: {0} von {1} abgeschlossen

source: When
de_de: Wenn

source: Go to Start
de_de: Zum Start gehen

source: very slow
de_de: sehr langsam

source: slow
de_de: langsam

source: fast
de_de: schnell

source: really fast
de_de: sehr schnell

source: forward
de_de: nach vorne

source: backward
de_de: zurück

source: left
de_de: links

source: right
de_de: rechts

source: up
de_de: hoch

source: straight
de_de: geradeaus

source: down
de_de: runter

source: Forward
de_de: Vorwärts

source: Backward
de_de: Rückwärts

source: Turn Left
de_de: Nach links drehen

source: Turn Right
de_de: Nach rechts drehen

source: Stop Wheels
de_de: Räder stoppen

source: Set Wheel Speed
de_de: Radgeschwindigkeit einstellen

source: Turn to Voice
de_de: Zur Stimme drehen

source: Look towards Voice
de_de: In Richtung der Stimme schauen

source: Missing Block!
de_de: Block fehlt!

source: Record a New Sound
de_de: Nimm einen neuen Sound auf

source: Launch with{0}% Power
de_de: Mit{0}% Leistung katapultieren

source: Load Launcher{0}
de_de: Katapult{0} laden

source: Need a hint?
de_de: Brauchst du einen Tipp?

source: There are no "{0}" animations for {1}
de_de: Es gibt keine „{0}“-Animationen für {1}

source: Huh?
de_de: Hä?

source: Uh oh!
de_de: Oh, oh!

source: Sigh..
de_de: Seufz ...

source: Wee!
de_de: Hui!

source: Bye
de_de: Tschüss

source: Horse
de_de: Pferd

source: Cat
de_de: Katze

source: Dog
de_de: Hund

source: Dinosaur
de_de: Dinosaurier

source: Lion
de_de: Löwe

source: Goat
de_de: Ziege

source: Crocodile
de_de: Krokodil

source: Elephant
de_de: Elefant

source: Fire Siren
de_de: Feueralarm

source: Truck Horn
de_de: LKW-Hupe

source: Car Engine
de_de: Automotor

source: Car Tire Squeal
de_de: Reifenquietschen

source: Helicopter
de_de: Helikopter

source: Jet Plane
de_de: Jet

source: Boat
de_de: Boot

source: Train
de_de: Zug

source: Beeps
de_de: Pieptöne

source: Lasers
de_de: Laser

source: Gobble
de_de: Verschlingen

source: Buzz
de_de: Summen

source: Ay Yai Yai
de_de: Ei, ei, ei

source: Squeak
de_de: Quietschen

source: Top Button
de_de: Oberer Knopf

source: Button 1
de_de: Knopf 1

source: Button 2
de_de: Knopf 2

source: Button 3
de_de: Knopf 3

source: Obstacle In Front
de_de: Hindernis vorne

source: Obstacle On Left
de_de: Hindernis links

source: Obstacle On Right
de_de: Hindernis rechts

source: Object Behind
de_de: Objekt hinten

source: Hear Clap
de_de: Klatschen hören

source: Hear Voice
de_de: Stimme hören

source: Picked Up
de_de: Aufgehoben

source: Stuck
de_de: Festsitzen

source: See Dot
de_de: Sieh Dot

source: Move
de_de: Bewegung

source: Shake
de_de: Schütteln

source: Look Up
de_de: Hochschauen

source: Look Down
de_de: Runterschauen

source: Lean Left
de_de: Nach links lehnen

source: Lean Right
de_de: Nach rechts lehnen

source: Toss
de_de: In die Luft werfen

source: Take Off
de_de: Losbrausen

source: Spin Out
de_de: Rumdüsen

source: Flat Tire
de_de: Platter Reifen

source: Engine
de_de: Motor

source: Confident
de_de: Zuversichtlich

source: Silly
de_de: Albern

source: Happy
de_de: Glücklich

source: Celebrate
de_de: Freudentanz

source: Laugh
de_de: Lachen

source: Burp
de_de: Rülps

source: Kiss
de_de: Kuss

source: Help
de_de: Hilfe

source: Lets Do It
de_de: Legen wir los

source: Yah
de_de: Yeah

source: Whistle
de_de: Pfeifen

source: Dizzy
de_de: Duselig

source: Asleep
de_de: Schlafen

source: Hello
de_de: Hallo

source: Forget It
de_de: Vergiss es

source: Curious Bye
de_de: Neugieriges Tschüss

source: Frustrated Bye
de_de: Frustriertes Tschüss

source: Happy Bye
de_de: Glückliches Tschüss

source: How do you do?
de_de: Wie geht es dir?

source: Frustrated
de_de: Frustriert

source: Maybe
de_de: Vielleicht

source: No
de_de: Nein

source: Yes
de_de: Ja

source: Yes #2
de_de: Ja #2

source: Hold
de_de: Halten

source: Hide
de_de: Verstecken

source: Catch
de_de: Fangen

source: {0} and {1}
de_de: {0} und {1}

source: Confirm delete?
de_de: Löschen bestätigen?
